Repository: LandRegistry/search-local-land-charges-ui
Catalog: server/translations/*/LC_MESSAGES/messages.po
Languages: cy

source: Hold the SHIFT key and drag the cursor to draw a curved search area.
cy: Daliwch y fysell SHIFT a llusgwch y cyrchwr i dynnu ardal chwilio grwm.

source: Release the SHIFT key and mouse button to stop drawing.
cy: Rhyddhewch allwedd SHIFT a botwm y llygoden i roi'r gorau i dynnu llun.

source: Select the edit area radio button. You will see your search area turn green.
cy: Dewiswch y botwm radio ardal golygu. Byddwch yn gweld eich ardal chwilio yn troi'n wyrdd.

source: Select and drag the outline of your search area to edit it.
cy: Dewiswch a llusgwch amlinelliad eich ardal chwilio i'w olygu.

source: This video shows how to edit your search area using the edit area radio button.
cy: Mae'r fideo hwn yn dangos sut i olygu eich ardal chwilio gan ddefnyddio'r botwm radio ardal olygu.

source: Selects the edit area radio button.
cy: Yn dewis y botwm radio ardal golygu.

source: Sees the search area turn green.
cy: Yn gweld yr ardal chwilio yn troi'n wyrdd.

source: Selects one of the points.
cy: Yn dewis un o'r pwyntiau.

source: Drags the point to change the search area.
cy: Yn llusgo'r pwynt i newid yr ardal chwilio.

source: Holds ALT key while selecting another point to delete it.
cy: Yn dal allwedd ALT tra'n dewis pwynt arall i'w ddileu.

source: How to draw a search area with snap to line on map
cy: Sut i dynnu ardal chwilio gyda snap i linell ar y map

source: You can only use snap to line on map when you are zoomed into a location (seeing a place close-up). This option will be inactive until you are zoomed in enough.
cy: Dim ond pan fyddwch wedi chwyddo i mewn i leoliad (gweld lle yn agos i fyny) y gallwch ddefnyddio snap i linell ar fap. Bydd yr opsiwn hwn yn anactif nes eich bod wedi chwyddo digon.

source: Select the snap to line on map checkbox.
cy: Dewiswch y snap i linell ar y blwch ticio map.

source: Hover your cursor near the line or point you want to snap to.
cy: Hofranwch eich cyrchwr ger y llinell neu'r pwynt rydych chi am fynd ato.

source: The cursor will jump to that point automatically.
cy: Bydd y cyrchwr yn neidio i'r pwynt hwnnw'n awtomatig.

source: This feature can also be used during other map interactions, like edit area.
cy: Gellir defnyddio'r nodwedd hon hefyd yn ystod rhyngweithiadau map eraill, fel ardal olygu.

source: This video shows how to draw a search area with snap to line on map.
cy: Mae'r fideo hwn yn dangos sut i dynnu ardal chwilio gyda snap i linell ar fap.

source: Selects the snap to line on map checkbox.
cy: Yn dewis y snap i linell ar y blwch ticio map.

source: Hovers the cursor near where they want to begin drawing their search area.
cy: Yn hofran y cyrchwr yn agos at y man lle maen nhw am ddechrau tynnu eu man chwilio.

source: Sees the point snapping to a line on the map as they hover close to it.
cy: Yn gweld y pwynt yn mynd i linell ar y map wrth iddynt hofran yn agos ato.

source: Selects to add multiple points to draw their search area.
cy: Yn dewis ychwanegu pwyntiau lluosog i luniadu eu hardal chwilio.

source: Transcript for: How to draw a search area with snap to line on map
cy: Trawsgrifiad ar gyfer: Sut i lunio ardal chwilio gyda snap i linell ar y map

source: How to draw a search area with snap to line on map (video)
cy: Sut i dynnu ardal chwilio gyda snap i linell ar y map (fideo)

source: How to delete a search area
cy: Sut i ddileu ardal chwilio

source: Select the delete area radio button.
cy: Dewiswch y botwm radio dileu ardal.

source: Your search area will turn red.
cy: Bydd eich ardal chwilio yn troi'n goch.

source: Select the search area you want to delete.
cy: Dewiswch yr ardal chwilio rydych chi am ei dileu.

source: This video shows how to delete a search area using the delete area radio button.
cy: Mae'r fideo hwn yn dangos sut i ddileu ardal chwilio gan ddefnyddio'r botwm radio dileu ardal.

source: Selects the delete area radio button.
cy: Yn dewis y botwm radio dileu ardal.

source: Sees the search area turn red.
cy: Yn gweld yr ardal chwilio yn troi'n goch.

source: Selects two parts of the search area to remove them.
cy: Yn dewis dwy ran o'r ardal chwilio i gael gwared arnynt.

source: Transcript for: How to delete a search area
cy: Trawsgrifiad ar gyfer: Sut i ddileu ardal chwilio

source: How to delete a search area (video)
cy: Sut i ddileu ardal chwilio (fideo)

source: How to clear all
cy: Sut i glirio'r cyfan

source: Select the clear all button.
cy: Dewiswch y botwm clir i gyd.

source: This deletes everything you have drawn on the map.
cy: Mae hyn yn dileu popeth rydych chi wedi'i dynnu ar y map.

source: This video shows how to delete everything you have drawn on the map using the clear all button.
cy: Mae'r fideo hwn yn dangos sut i ddileu popeth rydych chi wedi'i dynnu ar y map gan ddefnyddio'r botwm clir i gyd.

source: Selects the clear all button.
cy: Yn dewis y botwm clir i gyd.

source: Sees everything they have drawn on the map being deleted.
cy: Yn gweld popeth maen nhw wedi'i dynnu ar y map yn cael ei ddileu.

source: Transcript for: How to clear all
cy: Trawsgrifiad ar gyfer: Sut i glirio popeth

source: How to clear all (video)
cy: Sut i glirio popeth (fideo)

source: Select the undo button.
cy: Dewiswch y botwm dadwneud.

source: Your last interaction with the map will be undone.
cy: Bydd eich rhyngweithiad diwethaf â'r map yn cael ei ddadwneud.

source: You can undo multiple actions in sequence.
cy: Gallwch ddadwneud gweithredoedd lluosog mewn dilyniant.

source: This video shows how to undo interactions with the map.
cy: Mae'r fideo hwn yn dangos sut i ddadwneud rhyngweithiadau â'r map.

source: Draws an area on the map.
cy: Yn lluniadu ardal ar y map.

source: Deletes an area.
cy: Yn dileu ardal.

source: Selects the undo button to undo deleting an area.
cy: Yn dewis y botwm dadwneud i ddadwneud dileu ardal.

source: Selects the undo button again to undo drawing an area.
cy: Yn dewis y botwm dadwneud eto i ddadwneud lluniadu ardal.

source: Arrow keys to move the map up, down, left and right.
cy: Bysellau saeth i symud y map i fyny, i lawr, i'r chwith ac i'r dde.

source: SHIFT key with arrows to fine-tune the position.
cy: Allwedd SHIFT gyda saethau i fireinio'r lleoliad.

source: Plus sign (+) to zoom in and Minus sign (-) to zoom out.
cy: Hefyd arwydd (+) i chwyddo i mewn ac arwydd Minus (-) i chwyddo allan.

source: SPACE bar or ENTER key to select the area at the centre of the map.
cy: Bar gofod neu fysell ENTER i ddewis yr ardal yng nghanol y map.

source: View release notices
cy: Gweld hysbysiadau rhyddhau

source: Select a date
cy: Dewis dyddiad

source: View updates or changes to local land charges service.
cy: Gweld diweddariadau neu newidiadau i’r gwasanaeth pridiannau tir lleol.

source: The following links open in a new tab:
cy: Mae’r cysylltau canlynol yn agor mewn tab newydd:

source: Release notice
cy: Hysbysiad rhyddhau

source: Format
cy: Fformat

source: Search for local land charges: Terms of Use
cy: Chwilio am bridiannau tir lleol: Telerau Defnyddio

source: About this service
cy: Ynglŷn â’r gwasanaeth hwn

source: You can use this service to find out about local land charges (restrictions) on land or property on the Local Land Charges Register
cy: Gallwch ddefnyddio’r gwasanaeth hwn i ddarganfod mwy am bridiannau tir lleol (cyfyngiadau) ar dir neu eiddo ar y Gofrestr Pridiannau Tir Lleol

source: Before you start your search, we recommend that you use our online search tool to find out if the authority you want to search has moved to the local land charges register
cy: Cyn ichi ddechrau eich chwiliad, rydym yn argymell eich bod yn defnyddio ein teclyn chwilio ar-lein i ddarganfod a yw’r awdurdod rydych am ei chwilio wedi symud i’r gofrestr pridiannau tir lleol

source: Once you know that HM Land Registry is responsible for local land charges for the relevant local authority area you can search by
cy: Unwaith y byddwch yn gwybod bod Cofrestrfa Tir EM yn gyfrifol am bridiannau tir lleol ar gyfer yr ardal awdurdod lleol berthnasol, gallwch chwilio gan ddefnyddio

source: Postcode, address or partial address
cy: Cod post, cyfeiriad neu gyfeiriad rhannol

source: Map (use the map buttons to draw a shape around the place you want to search)
cy: Map (defnyddiwch y botymau map i dynnu siâp o amgylch y lle rydych am ei chwilio)

source: Your search will show you a list of local land charges
cy: Bydd eich chwiliad yn dangos rhestr o bridiannau tir lleol

source: In the place you search
cy: Yn y lle rydych yn chwilio

source: At a particular time
cy: Ar adeg benodol

source: This service cannot tell you if a local land charge is being added to the register while you search
cy: Ni all y gwasanaeth hwn ddweud wrthych a yw pridiant tir lleol yn cael ei ychwanegu at y gofrestr wrth ichi chwilio

source: By using this service, you accept the terms of use on this page. Each term of use is separate. If any court decides any is unlawful, the rest will continue to be fully effective. The terms of use do not restrict your access to local land charges register information under the Environmental Information Regulations 2004 (EIR)
cy: Trwy ddefnyddio’r gwasanaeth hwn, rydych yn derbyn y telerau defnyddio ar y dudalen hon. Mae’r holl delerau defnyddio’n rhai unigol. Os yw unrhyw lys yn penderfynu bod unrhyw un yn anghyfreithlon, bydd y gweddill yn parhau i fod yn gwbl effeithiol. Nid yw’r telerau defnyddio yn cyfyngu ar eich mynediad i wybodaeth cofrestr pridiannau tir lleol o dan Reoliadau Gwybodaeth Amgylcheddol 2004

source: You can stop using this service at any time. HM Land Registry can stop you from using this service if you don’t comply with its terms of use.
cy: Gallwch roi’r gorau i ddefnyddio’r gwasanaeth hwn ar unrhyw adeg. Gall Cofrestrfa Tir EM eich atal rhag defnyddio’r gwasanaeth hwn os nad ydych yn cydymffurfio â’i delerau defnyddio.

source: What’s not included
cy: Yr hyn nad yw wedi ei gynnwys

source: Your search does not include, for example
cy: Nid yw eich chwiliad yn cynnwys, er enghraifft

source: Planning and development applications
cy: Ceisiadau cynllunio a datblygu

source: Building controls
cy: Rheolaethau adeiladu

source: Road development schemes near to your property
cy: Cynlluniau datblygu ffyrdd yn agos at eich eiddo

source: All CON29 enquiries should be made to the relevant Local Authority
cy: Dylid gwneud pob ymholiad CON29 i’r Awdurdod Lleol perthnasol

source: Personal and official search services
cy: Gwasanaethau chwiliad personol a swyddogol

source: You can choose from the
cy: Gallwch ddewis o’r

source: personal search service (this is free)
cy: gwasanaeth chwiliad personol (mae hwn am ddim)

source: official search service (a fee is payable for this service under the Local Land Charges Fees (England) Rules 2018). This is a secure document digitally signed by HM Land Registry
cy: gwasanaeth chwiliad swyddogol (mae ffi yn daladwy am y gwasanaeth hwn o dan Reolau Ffïoedd Pridiannau Tir Lleol (Lloegr) 2018). Mae hon yn ddogfen ddiogel wedi ei llofnodi’n ddigidol gan Gofrestrfa Tir EM

source: If you choose the official search service, you can download your official search certificate and print a copy
cy: Os ydych yn dewis y gwasanaeth chwiliad swyddogol, gallwch lawrlwytho’ch tystysgrif chwiliad swyddogol ac argraffu copi

source: If you choose the official search service you can update your official search certificate by making as many free repeat search applications as you require for 6 months after your original search date. Each time you repeat your search application, an official search certificate will be issued. You will have to pay for any repeat search made after 6 months has expired
cy: Os ydych yn dewis y gwasanaeth chwiliad swyddogol, gallwch ddiweddaru eich tystysgrif chwiliad swyddogol trwy wneud cymaint o geisiadau chwilio ailadroddus di-dâl ag sydd ei angen arnoch am 6 mis ar ôl eich dyddiad chwilio gwreiddiol. Bob tro rydych yn ailadrodd eich cais chwilio, rhoddir tystysgrif chwiliad swyddogol. Bydd yn rhaid ichi dalu am unrhyw chwiliad ailadroddus a wneir ar ôl i 6 mis ddod i ben

source: Personal search
cy: Chwiliad personol

source: A personal search will let you inspect the register and show you
cy: Bydd chwiliad personol yn caniatáu ichi archwilio’r gofrestr a dangos y canlynol ichi

source: a description of the local land charge
cy: disgrifiad o’r pridiant tir lleol

source: the registration date, the date when the charge was added to the register
cy: y dyddiad cofrestru, y dyddiad yr ychwanegwyd y pridiant at y gofrestr

source: contact details for the authority that can answer questions about the local land charge (where available)
cy: manylion cyswllt yr awdurdod a all ateb cwestiynau am y pridiant tir lleol (pan fyddant ar gael)

source: A personal search is free and is access to the local land charges register under the EIR. These terms of use do not restrict your access to local land charges register information under the EIR
cy: Mae chwiliad personol yn rhad ac am ddim ac yn fynediad i’r gofrestr pridiannau tir lleol o dan Reoliadau Gwybodaeth Amgylcheddol 2004. Nid yw’r telerau defnyddio hyn yn cyfyngu eich mynediad i wybodaeth cofrestr pridiannau tir lleol o dan Reoliadau Gwybodaeth Amgylcheddol 2004

source: Official Search
cy: Chwiliad Swyddogol

source: The official search will show the same information as the personal search plus
cy: Bydd y chwiliad swyddogol yn dangos yr un wybodaeth â’r chwiliad personol ynghyd â’r canlynol

source: search boundary/area on a map
cy: terfyn/ardal chwiliad ar fap

source: originating authority name, reference and any electronic link they have provided to a document or register kept by them relevant to the charge
cy: enw a chyfeirnod yr awdurdod gwreiddiol ac unrhyw gyswllt electronig a ddarparwyd ganddynt i ddogfen neu gofrestr a gedwir ganddynt sy’n berthnasol i’r pridiant

source: local land charge boundary
cy: terfyn pridiant tir lleol

source: You can download the official search certificate as a secure document, digitally signed by HM Land Registry
cy: Gallwch lawrlwytho’r dystysgrif chwiliad swyddogol fel dogfen ddiogel, wedi ei llofnodi’n ddigidol gan Gofrestrfa Tir EM

source: A fee is payable for an official search.
cy: Mae ffi yn daladwy am chwiliad swyddogol

source: Opening an account
cy: Agor cyfrif

source: You need to set up an account to access the search service, with it you will get for 6 months
cy: Mae angen ichi greu cyfrif er mwyn defnyddio’r gwasanaeth chwilio. Trwy hyn fe gewch am 6 mis

source: cloud storage for your searches
cy: lle i storio trwy gwmwl ar gyfer eich chwiliadau

source: a search result archive
cy: archif canlyniadau chwiliadau

source: unlimited downloads
cy: lawrlwythiadau diderfyn

source: a dashboard showing
cy: dangosfwrdd yn dangos

source: active searches (searches less than 6 months old). You can update these searches by making as many free repeat search applications as you want, for 6 months after your original search date. Each time you repeat your search application, an official search certificate will be issued
cy: chwiliadau gweithredol (chwiliadau llai na 6 mis oed). Gallwch ddiweddaru eich tystysgrif chwiliad swyddogol trwy wneud cymaint o geisiadau chwilio ailadroddus di-dâl ag sydd ei angen arnoch am 6 mis ar ôl eich dyddiad chwilio gwreiddiol. Bob tro rydych yn ailadrodd eich cais chwilio, rhoddir tystysgrif chwiliad swyddogol

source: expired searches (searches older than 6 months). You can repeat these, but you will need to pay when you search again
cy: chwiliadau sydd wedi dod i ben (chwiliadau sy'n hŷn na 6 mis). Gallwch ailadrodd y rhain, ond bydd angen ichi dalu wrth chwilio eto

source: What you need to set up an account
cy: Yr hyn sydd ei angen arnoch i greu cyfrif

source: To set up an account you must provide your
cy: I greu cyfrif, rhaid ichi ddarparu’ch

source: name
cy: enw

source: email
cy: ebost

source: password
cy: cyfrinair

source: HM Land Registry will email you to tell you that your account has been created
cy: Bydd Cofrestrfa Tir EM yn anfon ebost atoch i ddweud bod eich cyfrif wedi ei greu

source: If you need to change your email address details, you can set up a new account using a different email address
cy: Os oes angen ichi newid manylion eich cyfeiriad ebost, gallwch greu cyfrif newydd gan ddefnyddio cyfeiriad ebost gwahanol

source: Keeping your account secure
cy: Cadw’ch cyfrif yn ddiogel

source: You are responsible for
cy: Rydych yn gyfrifol am y canlynol

source: keeping your username and password secure
cy: cadw’ch enw defnyddiwr a’ch cyfrinair yn ddiogel

source: all activity that occurs on or through your account
cy: yr holl weithgaredd sy’n digwydd ar eich cyfrif neu trwy’ch cyfrif

source: If you think your account’s security has been breached, contact HM Land Registry
cy: Os ydych yn credu bod diogelwch eich cyfrif wedi ei dorri, cysylltwch â Chofrestrfa Tir EM

source: phone: 0300 006 0411
cy: ffôn: 0300 006 0422 (am wasanaeth Cymraeg)

source: speak to a Welsh speaker: 0300 006 0422
cy: ffôn: 0300 006 0411 (am wasanaeth Saesneg)

source: If you don’t use your account for 12 months, we will delete it
cy: Os nad ydych yn defnyddio’ch cyfrif am 12 mis, byddwn yn ei ddileu

source: HM Land Registry is not responsible for any losses if someone else using your log in and user identification uses your account
cy: Nid yw Cofrestrfa Tir EM yn gyfrifol am unrhyw golledion os bydd rhywun arall sy’n defnyddio’ch manylion mewngofnodi a’ch dull adnabod defnyddiwr yn defnyddio eich cyfrif

source: How and when you can access the service
cy: Sut a phryd y gallwch gael mynediad i’r gwasanaeth

source: You can access the service from any supported internet connected device and browser
cy: Gallwch gyrchu’r gwasanaeth o unrhyw ddyfais a phorwr sy’n gysylltiedig â’r rhyngrwyd

source: The service is available every day but may be taken down for updates and maintenance. If you are logged in when this happens, you’ll get a notification on your screen.
cy: Mae’r gwasanaeth ar gael bob dydd ond gellir ei dynnu i lawr ar gyfer diweddariadau ac adegau cynnal a chadw. Os yw hyn yn digwydd pan fyddwch wedi mewngofnodi, cewch hysbysiad ar eich sgrin

source: By using the service and/or registering an account, you agree that you will not
cy: Trwy ddefnyddio’r gwasanaeth a/neu wrth gofrestru cyfrif, rydych yn cytuno na fyddwch yn gwneud y canlynol

source: attempt to damage, impair or interrupt the service or access to it
cy: ceisio difrodi, amharu neu dorri ar draws y gwasanaeth neu fynediad iddo

source: use any automated software agents to search, copy, monitor, display, obtain links to or otherwise access this or any other HM Land Registry system
cy: defnyddio unrhyw asiantau meddalwedd awtomataidd i chwilio, copïo, monitro, arddangos, cael cysylltau i neu gyrchu fel arall y system hon neu unrhyw system arall o eiddo Cofrestrfa Tir EM

source: copy or display the information provided for display on another website
cy: copïo neu arddangos y wybodaeth a ddarperir i’w harddangos ar wefan arall

source: attempt to add, change or delete any information provided and held by HM Land Registry
cy: ceisio ychwanegu, newid neu ddileu unrhyw wybodaeth a ddarperir ac a gedwir gan Gofrestrfa Tir EM

source: allow anyone else access your account using your User ID and password
cy: caniatáu i unrhyw un arall gael mynediad i’ch cyfrif gan ddefnyddio’ch Dynodydd Defnyddiwr a’ch cyfrinair

source: use the information provided by the service to claim any arrangement or official partnership with HM Land Registry to supply or reuse data and/or information
cy: defnyddio’r wybodaeth a ddarperir gan y gwasanaeth i hawlio unrhyw drefniant neu bartneriaeth swyddogol gyda Chofrestrfa Tir EM i gyflenwi neu ailddefnyddio data a/neu wybodaeth

source: use the data for any fraudulent or unlawful activity including breaches of data protection law
cy: defnyddio’r data ar gyfer unrhyw weithgaredd twyllodrus neu anghyfreithlon gan gynnwys torri cyfraith diogelu data

source: If you are not using this service in the agreed way
cy: Os nad ydych yn defnyddio’r gwasanaeth hwn yn y ffordd y cytunwyd arni

source: HM Land Registry can end your use of the service and cancel your account at any time, without notice
cy: gall Cofrestrfa Tir EM ddod â’ch defnydd o’r gwasanaeth i ben a dileu eich cyfrif ar unrhyw adeg, heb rybudd

source: you will have to pay any unpaid official search fees
cy: bydd yn rhaid ichi dalu unrhyw ffïoedd chwiliadau swyddogol na chafodd eu talu

source: Payments to HM Land Registry
cy: Taliadau i Gofrestrfa Tir EM

source: By using the official search service, you agree to be bound by and pay for any official search certificate you apply for
cy: Trwy ddefnyddio’r gwasanaeth chwiliad swyddogol, rydych yn cytuno i gael eich rhwymo gan unrhyw dystysgrif chwiliad swyddogol y gwneir cais amdani ac yn talu amdani

source: Because the official search certificate information is provided immediately, once you pay for it you lose the right of cancellation you would normally have under The Consumer Contracts (Information, Cancellation and Additional Charges) Regulations 2013
cy: Oherwydd bod gwybodaeth swyddogol y dystysgrif chwiliad yn cael ei darparu ar unwaith, unwaith y byddwch yn talu amdani, rydych yn colli’r hawl i ganslo a fyddai gennych fel arfer o dan Reoliadau Contractau Defnyddwyr (Gwybodaeth, Canslo a Ffïoedd Ychwanegol) 2013

source: This means that by applying to buy an official search on land or property you have identified you agree
cy: Mae hyn yn golygu eich bod trwy wneud cais i brynu chwiliad swyddogol ar dir neu eiddo eich bod yn cytuno

source: to pay the fee for this service by making an online transaction (through GOV.PAY)
cy: i dalu’r ffi am y gwasanaeth hwn trwy wneud trafodiad ar-lein (trwy GOV.PAY)

source: that the local land charge official search certificate will be provided as soon as you have paid
cy: y bydd y dystysgrif chwiliad swyddogol pridiant tir lleol yn cael ei darparu cyn gynted ag y byddwch wedi talu

source: and accept you lose your right to cancel once the official search certificate are made available for download
cy: derbyn eich bod yn colli’ch hawl i ganslo unwaith y bydd y dystysgrif chwiliad swyddogol ar gael i’w lawrlwytho

source: HM Land Registry is not responsible for the security or privacy of information you provide when making a transaction through the service’s online payment provider. If you have an issue with this, you should
cy: Nid yw Cofrestrfa Tir EM yn gyfrifol am ddiogelwch na phreifatrwydd gwybodaeth a ddarperir gennych wrth wneud trafodiad trwy ddarparwr talu ar-lein y gwasanaeth. Os oes gennych broblem gyda hyn, dylech

source: contact the online payment provider directly
cy: gysylltu â’r darparwr talu ar-lein yn uniongyrchol

source: tell HM Land Registry about the outcome by calling 0300 006 0411
cy: dweud wrth Gofrestrfa Tir EM am y canlyniad trwy ffonio 0300 006 0422

source: Your agreement with HM Land Registry
cy: Eich cytundeb â Chofrestrfa Tir EM
