Repository: LandRegistry/search-local-land-charges-ui
Catalog: server/translations/*/LC_MESSAGES/messages.po
Languages: cy

source: Search for local land charges
cy: Chwilio am bridiannau tir lleol

source: Not provided
cy: Heb ei ddarparu

source: Invalid charge id. Try again
cy: Dynodydd pridiant annilys. Rhowch gynnig arall

source: Enter a valid postcode or location
cy: Rhowch god post neu leoliad dilys

source: Enter a postcode or location
cy: Nodwch god post neu leoliad

source: Invalid postcode. Try again
cy: Cod post annilys. Rhowch gynnig arall.

source: No results found
cy: Dim canlyniadau

source: Enter a postcode
cy: Nodwch god post

source: Invalid uprn. Try again
cy: Uprn annilys. Rhowch gynnig arall

source: Enter a uprn
cy: Nodwch uprn

source: Invalid usrn, please try again
cy: Usrn annilys. Rhowch gynnig arall

source: Enter a usrn
cy: Nodwch usrn

source: Previous
cy: Blaenorol

source: Next
cy: Nesaf

source: You have activated your account
cy: Rydych wedi actifadu’ch cyfrif

source: Sign in
cy: Mewngofnodi

source: Change your password
cy: Newid eich cyfrinair

source: Your password must
cy: Rhaid i’ch cyfrinair

source: be at least 8 characters long
cy: fod o leiaf 8 nod o ran hyd

source: use both capital and lower case letters
cy: cynnwys priflythrennau a llythrennau bychain

source: use at least 1 number
cy: cynnwys o leiaf 1 rhif

source: use at least 1 symbol, like a question mark
cy: cynnwys o leiaf 1 symbol, fel marc cwestiwn

source: Check your email
cy: Edrychwch ar eich negeseuon ebost

source: We have sent an email to %(email)s.
cy: Rydym wedi anfon ebost at %(email)s.

source: You need to activate your account for Search for local land charges
cy: Mae angen ichi actifadu eich cyfrif ar gyfer Chwilio am bridiannau tir lleol

source: To continue, select the link in the email to activate your account
cy: I barhau, dewiswch y cyswllt yn yr ebost i actifadu eich cyfrif

source: resend email
cy: ailanfonwch yr ebost

source: If you did not get an email, check your junk inbox or %(link_html)s
cy: Os na chawsoch chi ebost, edrychwch yn eich mewnflwch sothach neu %(link_html)s

source: Your activation link has expired
cy: Mae eich cyswllt actifadu wedi dod i ben

source: Your link has expired
cy: Mae eich cyswllt wedi dod i ben

source: Enter your email address and we will send you a new link
cy: Nodwch eich cyfeiriad ebost ac fe anfonwn gyswllt newydd atoch

source: The link to activate your account is invalid
cy: Mae’r cyswllt i actifadu’ch cyfrif yn annilys

source: Enter your email address again
cy: Nodwch eich cyfeiriad ebost unwaith eto

source: We’ll email you a new link to activate your Search for local land charges account
cy: Byddwn yn anfon cyswllt newydd i actifadu’ch cyfrif Chwilio am bridiannau tir lleol atoch trwy ebost

source: The link to change your password has already been used or is invalid
cy: Mae’r cyswllt i newid eich cyfrinair eisoes wedi cael ei ddefnyddio neu mae’n annilys

source: We’ll email you a new link to change your password
cy: Byddwn yn anfon cyswllt newydd i newid eich cyfrinair atoch trwy ebost

source: To change your password select the link in the email. If you did not get an email, check your junk inbox or %(link_html)s
cy: I newid eich cyfrinair, dewiswch y cyswllt yn yr ebost. Os na chawsoch ebost, edrychwch yn eich mewnflwch sothach neu %(link_html)s

source: Create an account
cy: Creu cyfrif

source: https://www.gov.uk/government/organisations/land-registry/about/personal-information-charter
cy: https://www.gov.uk/government/organisations/land-registry/about/personal-information-charter.cy

source: personal information charter
cy: siarter gwybodaeth bersonol

source: Your personal information will be used to manage your account, process search requests and to contact you. We may retain and share it to help detect and prevent fraud, in line with our %(link_html)s
cy: Caiff eich gwybodaeth bersonol ei defnyddio i reoli’ch cyfrif, prosesu ceisiadau chwilio ac i gysylltu â chi. Efallai y byddwn yn ei chadw ac yn ei rhannu i helpu i ganfod ac atal twyll, yn unol â’n %(link_html)s

source: terms of use
cy: telerau defnyddio

source: By creating an account, you are agreeing to %(link_html)s
cy: Trwy greu cyfrif, rydych yn cytuno â’n %(link_html)s

source: sign in
cy: mewngofnodwch

source: If you already have an account, %(link_html)s
cy: Os oes gennych gyfrif yn barod, %(link_html)s

source: Enter your email address
cy: Nodwch eich cyfeiriad ebost

source: We use some essential cookies to make this service work
cy: Rydym yn defnyddio rhai cwcis hanfodol i wneud i’r gwasanaeth hwn weithio

source: We’d like to set additional cookies so we can remember your settings, understand how people use the service and make improvements
cy: Hoffem osod cwcis ychwanegol er mwyn inni allu cofio eich gosodiadau, deall sut mae pobl yn defnyddio’r gwasanaeth a gwneud gwelliannau

source: You’ve accepted additional cookies. You can
cy: Rydych wedi derbyn cwcis ychwanegol. Gallwch

source: change your cookie settings
cy: newid eich gosodiadau cwci

source: at any time
cy: ar unrhyw adeg

source: You’ve rejected additional cookies. You can
cy: Rydych wedi gwrthod cwcis ychwanegol. Gallwch

source: Cookies on
cy: Cwcis ymlaen

source: Accept additional cookies
cy: Derbyn cwcis ychwanegol

source: Reject additional cookies
cy: Gwrthod cwcis ychwanegol

source: View cookies
cy: Gweld cwcis

source: Hide cookie message
cy: Cuddio’r neges ynghylch cwcis

source: This is a new service – your feedback will help us to improve it
cy: Gwasanaeth newydd yw hwn – bydd eich adborth yn ein helpu i’w wella

source: Feedback form
cy: Ffurflen adborth

source: link opens in new tab
cy: mae’r cyswllt yn agor mewn tab newydd

source: Back
cy: Yn ôl

source: There is a problem
cy: Mae problem

source: My account
cy: Fy nghyfrif

source: Sign out
cy: Allgofnodi

source: Register
cy: Cofrestru

source: Contact HM Land Registry
cy: Cysylltwch â Chofrestrfa Tir EM

source: Accessibility statement
cy: Datganiad hygyrchedd ar gyfer Cofrestrfa Tir EF – Chwilio am bridiannau tir lleol

source: Cookies
cy: Cwcis

source: Terms of use
cy: Telerau defnyddio

source: Built by
cy: Adeiladwyd gan

source: https://www.gov.uk/government/organisations/land-registry
cy: https://www.gov.uk/government/organisations/land-registry.cy

source: HM Land Registry
cy: Cofrestrfa Tir EM

source: &copy; Crown copyright
cy: &copy; Hawlfraint y Goron

source: All content is available under the
cy: Mae’r holl gynnwys ar gael dan

source: https://www.nationalarchives.gov.uk/doc/open-government-licence/version/3/
cy: https://www.nationalarchives.gov.uk/doc/open-government-licence-cymraeg/version/3/

source: Open Government Licence v3.0
cy: Drwydded Llywodraeth Agored v3.0

source: except where otherwise stated
cy: ac eithrio ble nodir yn wahanol

source: List of categories
cy: Rhestr o gategorïau

source: Sub-categories and instruments
cy: Is-gategorïau ac offerynnau

source: Sub-category
cy: Is-gategori

source: Instrument
cy: Offeryn

source: Category has no sub-categories
cy: Nid oes gan y categori unrhyw is-gategorïau

source: Hide
cy: Cuddio

source: Hide all sections
cy: Cuddio pob adran

source: Hide this section
cy: Cuddio’r adran hon

source: Show
cy: Dangos

source: Show all sections
cy: Dangos pob adran

source: Show this section
cy: Dangos yr adran hon

source: Statutory provisions
cy: Darpariaethau statudol

source: Use the list to check if a new statutory provision is available or if an existing one has changed.
cy: Defnyddiwch y rhestr i weld a oes darpariaeth statudol newydd ar gael neu a yw un sy’n bodoli wedi newid.

source: View removed statutory provisions
cy: Gweld darpariaethau statudol wedi eu tynnu i ffwrdd

source: Sort by
cy: Trefnu yn ôl

source: Current statutory provisions
cy: Darpariaethau statudol cyfredol

source: Last updated
cy: Diweddarwyd ddiwethaf

source: Changes
cy: Newidiadau

source: Removed statutory provisions
cy: Darpariaethau statudol wedi eu tynnu i ffwrdd

source: Check which statutory provisions have been removed.
cy: Gweld pa ddarpariaethau statudol sydd wedi eu tynnu i ffwrdd.

source: View current statutory provisions
cy: Gweld darpariaethau statudol cyfredol

source: Removed statutory provisions with date removed (if available)
cy: Darpariaethau statudol wedi eu tynnu i ffwrdd gyda dyddiad wedi ei dynnu i ffwrdd (os ydynt ar gael)

source: Date removed
cy: Dyddiad tynnu i ffwrdd

source: Previous name
cy: Enw blaenorol

source: Check if a local authority is available on this service
cy: Edrych i weld a oes awdurdod lleol ar gael ar y gwasanaeth hwn

source: Enter a local authority
cy: Nodwch awdurdod lleol

source: You may know a local authority as a council. For example, 'The North Yorkshire Council'.
cy: Efallai eich bod yn adnabod awdurdod lleol fel cyngor. Er enghraifft, ‘Cyngor Gogledd Swydd Efrog’.

source: Find out which local authority your search area belongs to
cy: Gweld i ba awdurdod lleol mae eich ardal chwilio yn perthyn

source: (opens in new tab)
cy: (mae’n agor mewn tab newydd)

source: %(org_name)s is on the register but information for this area is temporarily not available
cy: %(org_name)s ar y gofrestr ond nid oes gwybodaeth ar gyfer y maes hwn ar gael am y tro

source: %(org_name)s is available on this service
cy: Mae %(org_name)s ar gael ar y gwasanaeth hwn

source: %(org_name)s is not yet available on this service
cy: Nid yw %(org_name)s ar gael ar y gwasanaeth hwn eto

source: We're currently working on making this information available again. You'll be able to search this area once we've done that.
cy: Rydym yn gweithio ar hyn o bryd ar sicrhau bod y wybodaeth hon ar gael eto. Byddwch yn gallu chwilio’r ardal hon ar ôl inni wneud hynny.

source: Return to start
cy: Dychwelyd i’r dechrau

source: Check another local authority
cy: Edrych am awdurdod lleol arall

source: Continue with search
cy: Parhau â’r chwiliad

source: Contact the local authority for local land charges information.
cy: Cysylltwch â’r awdurdod lleol am wybodaeth pridiannau tir lleol.

source: Error:
cy: Gwall:

source: An error has occured
cy: Mae gwall wedi digwydd

source: Error code:
cy: Cod gwall:

source: Page not found
cy: Tudalen heb ei darganfod

source: Access denied
cy: Mynediad wedi ei wrthod

source: Sorry, there is a problem with the service
cy: Mae’n ddrwg gennym ond mae problem gyda’r gwasanaeth

source: If you entered a web address please check it was correct
cy: Os nodwyd cyfeiriad gwe, gwnewch yn siwr ei fod yn gywir

source: You do not have permission to access the requested resource
cy: Nid oes gennych ganiatâd i gael yr adnodd y gofynnwyd amdano

source: Try again later
cy: Rhowch gynnig arall yn nes ymlaen

source: https://customerhelp.landregistry.gov.uk/contactus
cy: https://customerhelp.landregistry.gov.uk/welshcontactuswebform/

source: contact HM Land Registry
cy: cysylltwch â Chofrestrfa Tir EF

source: If this problem persists, %(contact_link_html)s
cy: Os yw’r broblem hon yn parhau, %(contact_link_html)s

source: Your official search result failed to load
cy: Methodd canlyniad eich chwiliad swyddogol â llwytho

source: active searches
cy: chwiliadau gweithredol

source: To try again, visit %(active_searches_link)s.
cy: I roi cynnig arall, ewch i %(active_searches_link)s.

source: You’ve submitted this form too many times
cy: Rydych wedi cyflwyno’r ffurflen hon ormod o weithiau

source: Success
cy: Llwyddiant

source: Important
cy: Pwysig

source: (link opens in new tab)
cy: (mae’r cyswllt yn agor mewn tab newydd)

source: contact local land charges support
cy: cysylltwch â chymorth pridiannau tir lleol

source: You need to turn on JavaScript to use this service. For assistance, %(contact_html)s.
cy: Mae angen ichi droi JavaScript ymlaen i ddefnyddio’r gwasanaeth hwn. Am gymorth, %(contact_html)s.

source: Search for local land charges: Accessibility statement for HM Land Registry
cy: Chwilio am bridiannau tir lleol: Datganiad hygyrchedd ar gyfer Cofrestrfa Tir EF

source: Accessibility statement for HM Land Registry – Search for local land charges
cy: Datganiad hygyrchedd ar gyfer Cofrestrfa Tir EF – Chwilio am bridiannau tir lleol

source: Contents
cy: Cynnwys

source: Accessibility statement for Search for local land charges
cy: Datganiad hygyrchedd ar gyfer Chwilio am bridiannau tir lleol

source: Technical information about this website’s accessibility
cy: Gwybodaeth dechnegol am hygyrchedd y wefan hon

source: Non-accessible content
cy: Cynnwys anhygyrch

source: What we’re doing to improve accessibility
cy: Yr hyn rydym yn ei wneud i wella hygyrchedd

source: Preparation of this accessibility statement
cy: Paratoi’r datganiad hygyrchedd hwn

source: This accessibility statement applies to the
cy: Mae’r datganiad hygyrchedd hwn ar gyfer y

source: Search for local land charges service
cy: gwasanaeth Chwilio am bridiannau tir lleol

source: This website is run by HM Land Registry. We want as many people as possible to be able to use this website. For example, that means you should be able to
cy: Cofrestrfa Tir EF sy’n rhedeg y wefan hon. Rydym am i gynifer o bobl â phosibl allu defnyddio’r wefan hon. Er enghraifft, mae hynny’n golygu y dylech chi allu

source: change colours, contrast levels, fonts and font size using browser or device settings
cy: newid lliwiau, lefelau cyferbyniad, ffontiau a maint ffontiau gan ddefnyddio gosodiadau porwr neu ddyfais

source: zoom in up to 200%% without the text spilling off the screen
cy: chwyddo mewn hyd at 200%% heb i’r testun arllwys oddi ar y sgrin

source: navigate most of this website using a keyboard or speech recognition software, excluding the map
cy: llywio’r rhan fwyaf o’r wefan gan ddefnyddio bysellfwrdd neu feddalwedd adnabod llais, ac eithrio’r map

source: listen to most of the website using a screen reader, including the most recent versions of
cy: gwrando ar y rhan fwyaf o’r wefan gan ddefnyddio darllenydd sgrin, gan gynnwys y fersiynau diweddaraf o

source: and Voiceover
cy: a Voiceover

source: access the website using a variety of devices, screen sizes and orientations
cy: cyrchu’r wefan gan ddefnyddio amrywiaeth o ddyfeisiadau, meintiau sgrin a chyfeiriadau

source: We’ve also made the website text as simple as possible to understand. We only use technical terms where there is no easier wording to use without changing the meaning
cy: Rydym wedi gwneud testun y wefan mor syml â phosibl i’w ddeall hefyd. Rydym yn defnyddio termau technegol dim ond lle nad oes geiriad haws i’w ddefnyddio heb newid yr ystyr

source: %(ability_net_link)s has advice on making your device easier to use if you have a disability
cy: Mae gan %(ability_net_link)s gyngor ar wneud eich dyfais yn haws i’w defnyddio os oes gennych anabledd

source: How accessible this website is
cy: Pa mor hygyrch yw’r wefan hon

source: We know some parts of this website are not fully accessible:
cy: Rydym yn gwybod nad yw rhannau o’r wefan hon yn gwbl hygyrch:

source: some screen readers and browsers may repeat, miss, or misread text on the page, for example when using Google Chrome and the Apple voiceover feature
cy: gall rhai darllenwyr sgrin a phorwyr ailadrodd, colli, neu gamddarllen testun ar y dudalen, er enghraifft wrth ddefnyddio Google Chrome a nodwedd trosleisio Apple

source: users with keyboard-only control cannot access all map features
cy: ni all defnyddwyr sydd â rheolaeth bysellfwrdd yn unig gyrchu holl nodweddion y map

source: the map has no text alternative to allow screen reader users to identify sensory information being conveyed
cy: nid oes testun amgen ar y map i alluogi defnyddwyr darllenwyr sgrin i adnabod gwybodaeth synhwyraidd sy’n cael ei chyfleu

source: the videos on the How to use the map page do not have audio descriptions
cy: nid oes disgrifiadau sain ar y fideos ar y dudalen Sut i Ddefnyddio'r Map

source: Feedback and contact information
cy: Adborth a gwybodaeth gyswllt

source: If you find any problems not listed on this page or think we’re not meeting accessibility requirements, contact us
cy: Os cewch chi unrhyw broblemau nad ydynt wedi eu rhestru ar y dudalen hon neu’n credu nad ydym yn bodloni gofynion hygyrchedd, cysylltwch â ni

source: You can also contact us to request our assisted digital service if you would like support using the service
cy: Gallwch gysylltu â ni hefyd i ofyn am ein gwasanaeth digidol â chymorth os hoffech gael help i ddefnyddio’r gwasanaeth

source: If you need information on this website in a different format like accessible PDF, large print, easy read, audio recording or braille:
cy: Os oes angen gwybodaeth sydd ar y wefan hon arnoch mewn fformat gwahanol fel PDF hygyrch, print bras, hawdd ei ddarllen, recordiad sain neu braille, cysylltwch â ni:

source: Telephone
cy: Ffôn

source: Welsh language
cy: Gwasanaeth Cymraeg

source: Monday to Thursday, 8am to 5pm (except public holidays)
cy: Dydd Llun i ddydd Iau, 8am i 5pm (ac eithrio gwyliau cyhoeddus)

source: English language
cy: Gwasanaeth Saesneg

source: https://www.gov.uk/call-charges
cy: https://www.gov.uk/costau-galwadau

source: Find out about call charges
cy: Darllenwch am gost galwadau

source: Online contact form
cy: Ffurflen ar-lein

source: Submit an enquiry through
cy: Anfonwch ymholiad trwy ein

source: our contact form
cy: ffurflen gysylltu

source: We’ll respond to your request within 5 working days
cy: Byddwn yn ymateb i’ch cais o fewn 5 diwrnod gwaith

source: Address
cy: Cyfeiriad

source: Enforcement procedure
cy: Gweithdrefn orfodi

source: The Equality and Human Rights Commission (EHRC) is responsible for enforcing the Public Sector Bodies (Websites and Mobile Applications) (No. 2) Accessibility Regulations 2018 (the ‘accessibility regulations’). If you’re not happy with how we respond to your complaint,
cy: Mae’r Comisiwn Cydraddoldeb a Hawliau Dynol yn gyfrifol am orfodi Rheoliadau Hygyrchedd Cyrff Sector Cyhoeddus (Gwefannau a Chymwysiadau Symudol) (Rhif 2) 2018 (‘y rheoliadau hygyrchedd’). Os nad ydych yn hapus â’r ffordd rydym yn ymateb i’ch cwyn

source: contact the Equality Advisory and Support Service (EASS)
cy: cysylltwch â’r Gwasanaeth Cynghori a Chymorth Cydraddoldeb

source: Technical information about this website's accessibility
cy: Gwybodaeth dechnegol am hygyrchedd y wefan hon

source: HM Land Registry is committed to making its website accessible, in accordance with the Public Sector Bodies (Websites and Mobile Applications) (No. 2) Accessibility Regulations 2018
cy: Mae Cofrestrfa Tir EF wedi ymrwymo i wneud ei gwefan yn hygyrch, yn unol â Rheoliadau Hygyrchedd Cyrff Sector Cyhoeddus (Gwefannau a Chymwysiadau Symudol) (Rhif 2) 2018

source: Compliance status
cy: Statws cydymffurfio

source: The website has been tested against the Web Content Accessibility Guidelines (WCAG) 2.1 AA standard
cy: Profwyd y wefan hon yn erbyn safon 2.1 AA Canllawiau Hygyrchedd Cynnwys Gwe

source: This website is partially compliant with the
cy: Mae’r wefan hon yn cydymffurfio’n rhannol â

source: Web Content Accessibility Guidelines version 2.1
cy: safon AA Canllawiau HygyrcheddCynnwys Gwe fersiwn 2.1

source: AA standard, due to the non-compliances and exemptions listed below
cy: oherwydd yr achosion o ddiffyg cydymffurfio a nodir isod

source: The content listed below is non-accessible for the following reasons
cy: Nid yw’r cynnwys a restrir isod yn hygyrch am y rhesymau canlynol

source: Non-compliance with the accessibility regulations
cy: Diffyg cydymffurfio â’r rheoliadau hygyrchedd

source: The videos on the How to use the map page do not have audio descriptions. This fails WCAG 2.1 AA success criterion 1.2.5 Audio Description (Prerecorded)
cy: Nid oes disgrifiadau sain ar y fideos ar y dudalen Sut i ddefnyddio'r map.Mae hyn yn methu maen prawf llwyddiant WCAG 2.1 AA 1.2.5 Sain Ddisgrifiad (Wedi'i recordio ymlaen llaw)

source: We plan to add audio descriptions to these videos by the end of July 2024. When we publish new videos, we’ll make sure these have audio descriptions
cy: Rydym yn bwriadu ychwanegu disgrifiadau sain at y fideos hyn erbyn diwedd Gorffennaf 2024. Pan fyddwn yn cyhoeddi fideos newydd, byddwn yn sicrhau bod gan y rhain ddisgrifiadau sain

source: Disproportionate burden
cy: Baich anghymesur

source: There are no features in this service that are a disproportionate burden
cy: Nid oes unrhyw nodweddion yn y gwasanaeth hwn sy’n faich anghymesur

source: Content that’s not within the scope of the accessibility regulations
cy: Cynnwys nad yw o fewn cwmpas y rheoliadau hygyrchedd

source: Some screen readers may repeat, miss or misread content
cy: Gall rhai darllenwyr sgrin ailadrodd, methu neu gamddarllen cynnwys

source: Some screen readers on some browsers may repeat, miss, or misread content on the page, or tell users an incorrect number of radio buttons. For example, when using Google Chrome and the Apple voiceover feature
cy: Gall rhai darllenwyr sgrin ar rai porwyr ailadrodd, colli neu gamddarllen cynnwys ar y dudalen, neu roi nifer anghywir o fotymau radio i ddefnyddwyr. Er enghraifft, wrth ddefnyddio Google Chrome a nodwedd trosleisio Apple

source: This fails WCAG principle 1 – perceivable. There is no WCAG criterion naming specific screen readers
cy: Mae hyn yn methu egwyddor 1 Canllawiau Hygyrchedd Cynnwys Gwe – canfyddadwy. Nid oes unrhyw faen prawf Canllawiau Hygyrchedd Cynnwys Gwe sy’n enwi darllenwyr sgrin penodol

source: Text alternative on the map
cy: Testun amgen ar y map

source: The map has no text alternative to allow screen reader users to identify sensory information being conveyed. The text alternative does not include the search area or local land charge area that the map contains. This fails WCAG 2.1 A success criterion 1.3.3 Sensory Characteristics
cy: Nid oes testun amgen ar y map i alluogi defnyddwyr darllenwyr sgrin i adnabod gwybodaeth synhwyraidd sy’n cael ei chyfleu. Nid yw’r testun amgen yn cynnwys yr ardal chwilio neu’r ardal pridiant tir lleol mae’r map yn ei chynnwys. Mae hyn yn methu maen prawf llwyddiant 2.1 A Canllawiau Hygyrchedd Cynnwys Gwe 1.3.3 Nodweddion Synhwyraidd

source: Maps do not fall within the scope of accessibility regulations
cy: Nid yw mapiau yn dod o fewn cwmpas rheoliadau hygyrchedd

source: Keyboard-only control on maps
cy: Rheolaeth bysellfwrdd yn unig ar fapiau

source: You are unable to draw an area, edit an area or snap to a line on the map using only a keyboard. This fails WCAG 2.1 A success criterion 2.1.1 Keyboard
cy: Ni allwch luniadu ardal, golygu ardal na snapio i linell ar hwn gan ddefnyddio bysellfwrdd yn unig. Mae hyn yn methu WCAG 2.1 Maen prawf llwyddiant 2.1.1 Bysellfwrdd

source: You can select an area from the map and delete an area using only a keyboard
cy: Gallwch ddewis ardal o'r map a dileu ardal gan ddefnyddio bysellfwrdd yn unig

source: If you need assistance using the map, contact us using the details previously outlined in this accessibility statement
cy: Os oes angen cymorth arnoch i ddefnyddio’r map, cysylltwch â ni gan ddefnyddio’r manylion a amlinellwyd yn flaenorol yn y datganiad hygyrchedd hwn

source: We plan to add audio descriptions to the videos on the Help with the map page by the end of July 2024
cy: Rydym yn bwriadu ychwanegu disgrifiadau sain at y fideos ar y dudalen Help gyda’r map erbyn diwedd Gorffennaf 2024

source: This statement was prepared on %(publish)s. It was last reviewed on %(update)s
cy: Paratowyd y datganiad hwn ar %(publish)s. Fe’i diweddarwyd ddiwethaf ar %(update)s

source: This website was last tested on 5 August 2023 against the WCAG 2.1 AA standard
cy: Profwyd y wefan hon ddiwethaf ar 5 Awst 2023 yn erbyn safon 2.1 AA Canllawiau Hygyrchedd Cynnwys Gwe
