Repository: LandRegistry/search-local-land-charges-ui
Catalog: server/translations/*/LC_MESSAGES/messages.po
Languages: cy

source: You will need to contact them and Registers of Scotland to search this area
cy: Bydd angen ichi gysylltu â nhw a Chofrestri’r Alban i chwilio’r ardal hon

source: You will need to contact these authorities to search this area
cy: Bydd angen ichi gysylltu â’r awdurdodau hyn i chwilio’r ardal hon

source: Edit your search area
cy: Golygu eich ardal chwilio

source: Search result
cy: Canlyniad y chwiliad

source: The shaded area shows the extent area of the INSPIRE ID
cy: Mae’r ardal sydd wedi ei lliwio yn dangos ardal stent y dynodydd INSPIRE

source: Location
cy: Lleoliad

source: Category
cy: Categori

source: Law
cy: Y Gyfraith

source: Legal document
cy: Dogfen gyfreithiol

source: Authority reference
cy: Cyfeirnod yr awdurdod

source: Originating authority
cy: Awdurdod cychwynnol

source: Creation date
cy: Dyddiad creu

source: Registration date
cy: Dyddiad cofrestru

source: HM Land Registry reference
cy: Cyfeirnod Cofrestrfa Tir EM

source: Not the right area?
cy: Ddim yr ardal iawn?

source: Search again
cy: Chwilio eto

source: Search by coordinates
cy: Chwilio yn ôl cyfesurynnau

source: Ordnance Survey licence terms and conditions (opens in new tab)
cy: delerau ac amodau trwydded yr Arolwg Ordnans (mae’n agor mewn tab newydd)

source: Use of this data (including any link between the address and its location) is subject to %(os_terms_html)s.
cy: Mae defnyddio’r data cyfeiriad hwn (gan gynnwys unrhyw gysylltiad rhwng y cyfeiriad a’i leoliad) yn ddarostyngedig i %(os_terms_html)s.

source: https://www.gov.uk/government/publications/local-land-charges-pg79/local-land-charges
cy: https://www.gov.uk/government/publications/local-land-charges-pg79/18aefee4-d72d-480d-957d-bff151598cb9

source: Practice Guide 79
cy: Cyfarwyddyd Ymarfer 79

source: By starting a search you agree to our %(tou_html)s. For further information about the service see %(practice_html)s
cy: Trwy ddechrau chwilio, rydych yn cytuno â’n %(tou_html)s. I gael rhagor o wybodaeth am y gwasanaeth, gweler %(practice_html)s

source: Search by INSPIRE ID
cy: Chwilio trwy ddynodydd INSPIRE

source: Find out more about INSPIRE data (opens link in new tab).
cy: Darllenwch ragor am ddata INSPIRE (mae’r cyswllt yn agor mewn tab newydd)

source: Identify a search area
cy: Nodi ardal chwilio

source: To search for a local land charge, you will need to identify a property or area of land. We call this a search area.
cy: I chwilio am bridiant tir lleol, bydd angen ichi nodi eiddo neu ardal o dir. Yr ardal chwilio yw’r enw ar hyn.

source: Check if a local authority has moved to our central register.
cy: Gweld a yw awdurdod lleol wedi symud i’n cofrestr ganolog

source: Not all local authority areas are currently available to search on this system. For these areas you will need to contact the local authority.
cy: Nid yw pob ardal awdurdod lleol ar gael i’w chwilio ar y system ar hyn o bryd. Bydd angen ichi gysylltu â’r awdurdod lleol ar gyfer yr ardaloedd hyn.

source: Other ways to search for a local land charge
cy: Ffyrdd eraill i chwilio am bridiant tir lleol

source: Search by postcode or street name
cy: Chwilio yn ôl cod post neu enw stryd

source: Search by map
cy: Chwilio yn ôl map

source: Search by title number
cy: Chwilio yn ôl rhif teitl

source: Service updates
cy: Diweddariadau am y gwasanaeth

source: Local land charge search results
cy: Canlyniadau chwiliad pridiant tir lleol

source: Help make this service better
cy: Gwella’r gwasanaeth hwn

source: %(total_charges)s local land charges
cy: %(total_charges)s pridiant tir lleol

source: There are %(total_charges_html)s for your search area.
cy: Ceir %(total_charges_html)s ar gyfer eich ardal chwilio.

source: Your search area might include an authority we do not have information for. Charges for this authority are not included in your results.
cy: Efallai bydd eich ardal chwilio yn cynnwys awdurdod nad oes gennym wybodaeth ar ei gyfer. Ni fydd pridiannau am yr awdurdod hwn yn eich canlyniadau

source: Download an official search result for &pound;
cy: Lawrlwytho canlyniad chwiliad swyddogol am &pound;

source: By purchasing an official search result from us, you’ll receive a document that:
cy: Trwy brynu canlyniad chwiliad swyddogol gennym, cewch ddogfen sy’n:

source: is secure and digitally signed by HM Land Registry
cy: Gallwch lawrlwytho’r dystysgrif chwiliad swyddogol fel dogfen ddiogel, wedi ei llofnodi’n ddigidol gan Gofrestrfa Tir EM

source: highlights local land charge boundaries on a map
cy: dangos terfynau pridiannau tir lleol ar fap

source: enables you to get free, repeat searches for 6 months
cy: eich galluogi i gael chwiliadau am ddim, ailadroddus, am 6 mis

source: includes a link to the source information
cy: cynnwys cyswllt i’r wybodaeth ffynhonnell

source: Benefits of an official search
cy: Manteision chwiliad swyddogol

source: Continue to confirm exact search area
cy: Parhewch i gadarnhau’r union ardal chwilio

source: Sign in or
cy: Mewngofnodi neu

source: create an account
cy: greu cyfrif

source: Forgotten your password?
cy: Wedi anghofio eich cyfrinair?

source: There is an existing account for %(email)s, try again
cy: Mae cyfrif yn bodoli ar gyfer %(email)s. Rhowch gynnig arall arni

source: This password is not secure enough
cy: Nid yw’r cyfrinair hwn yn ddigon diogel

source: Your password has been changed
cy: Newidiwyd eich cyfrinair yn llwyddiannus

source: Your account details have been successfully changed
cy: Newidiwyd manylion eich cyfrif yn llwyddiannus

source: Current password is not correct
cy: Nid yw’r cyfrinair cyfredol yn gywir

source: You cannot request a repeat on this search as it has been refunded to you.
cy: Ni allwch ofyn am ailadrodd y chwiliad hwn gan ei fod wedi ei ad-dalu ichi.

source: You can request and download another official search result.
cy: Gallwch ofyn am ganlyniad chwiliad swyddogol arall a’i lawrlwytho.

source: Official search results are &pound;%(search_fee)s.
cy: &pound;%(search_fee)s yw canlyniadau chwilio swyddogol.

source: You have entered an invalid Search ID. Check it and try again
cy: Rydych wedi rhoi dynodydd chwilio annilys. Edrychwch eto a rhoi cynnig arall

source: Describe the search location
cy: Disgrifiwch yr ardal chwilio

source: Enter a postcode, select ‘Find address’ and choose an address from the list
cy: Rhowch god post, dewiswch ‘Dod o hyd i gyfeiriad’ a dewiswch gyfeiriad o’r rhestr

source: Official search result of local land charges
cy: Canlyniad chwiliad swyddogol pridiannau tir lleol

source: Downloading light obstruction notice documents for %(charge_id)s. If download does not start <a class="govuk-link" href="%(documents_url)s">click here.</a>
cy: Lawrlwytho dogfennau rhybudd rhwystr golau ar gyfer %(charge_id)s. Os nad yw llwytho i lawr yn dechrau <a class="govuk-link" href="%(documents_url)s">cliciwch yma.</a>

source: We do not recognise that title number. Check title number and try again
cy: Nid ydym yn adnabod y rhif teitl hwnnw. Gwiriwch y rhif teitl a rhoi cynnig arall arni

source: You have entered an invalid INSPIRE ID
cy: Rydych wedi nodi dynodydd INSPIRE annilys

source: Advance payment
cy: Taliad ymlaen llaw

source: Total compensation
cy: Cyfanswm yr iawndal

source: Agreed or estimated
cy: Cytunwyd neu amcangyfrif

source: Interest in land
cy: Budd mewn tir

source: Land sold
cy: Tir wedi ei werthu

source: Work done
cy: Gwaith wedi ei wneud

source: Amount
cy: Swm

source: Interest rate
cy: Cyfradd llog

source: Applicant %(applicant_no)s details
cy: Manylion ceisydd %(applicant_no)s

source: Height of servient land development
cy: Uchder datblygiad y tir caeth

source: Covers all or part of extent
cy: Yn cwmpasu’r cyfan neu ran ohono

source: Does not expire
cy: Nid yw'n dod i ben

source: You tried to log in using an invalid username or password. For security reasons, your account status has been changed to inactive
cy: Ceisiwyd mewngofnodi gan ddefnyddio enw defnyddiwr neu gyfrinair annilys. Am resymau diogelwch, mae statws eich cyfrif wedi ei newid i anweithredol

source: Email address and password do not match, try again or reset your password
cy: Nid yw’r cyfeiriad ebost a’r cyfrinair yn cyfateb. Rhowch gynnig arall arni neu ailosodwch eich cyfrinair

source: Enter a first name
cy: Nodwch enw cyntaf

source: First name must be 256 characters or fewer
cy: Rhaid i’r enw cyntaf gynnwys 255 nod neu lai

source: Enter a last name
cy: Nodwch gyfenw

source: Last name must be 256 characters or fewer
cy: Rhaid i’r cyfenw gynnwys 256 nod neu lai

source: Save changes
cy: Arbed newidiadau

source: New password
cy: Cyfrinair newydd

source: Enter a password
cy: Nodwch gyfrinair

source: Password must be 256 characters or fewer
cy: Rhaid i’r cyfrinair gynnwys 256 nod neu lai

source: Confirm new password
cy: Cadarnhau’r cyfrinair newydd

source: Enter a password in the correct format
cy: Nodwch gyfrinair yn y fformat cywir

source: Current password
cy: Cyfrinair cyfredol

source: Change password
cy: Newid cyfrinair

source: Passwords do not match, try again
cy: Nid yw’r cyfrineiriau’n cyfateb. Rhowch gynnig arall

source: Confirm password
cy: Cadarnhau cyfrinair

source: Submit
cy: Cyflwyno

source: Continue
cy: Parhau

source: No match found for %(search_auth)s
cy: Ni chafwyd cyfatebiaeth ar gyfer %(search_auth)s

source: Choose one option
cy: Dewiswch un opsiwn

source: Describe all search areas
cy: Disgrifiwch bob ardal chwilio

source: For example, 'flats 1-5 Church Lane' or 'land to the north of the bypass'.
cy: Er enghraifft, 'fflatiau 1-5 Church Lane' neu 'tir i'r gogledd o'r ffordd osgoi'.

source: Description must be shorter than 1000 characters
cy: Rhaid i’r disgrifiad fod yn fyrrach na 1000 o nodau

source: Do you want to accept analytics cookies?
cy: Ydych chi am dderbyn cwcis dadansoddol?

source: Select yes if you want to accept analytics cookies
cy: Dewiswch ‘ydw’ os ydych am dderbyn cwcis dadansoddol

source: No
cy: Nac ydw

source: Save cookie settings
cy: Arbed gosodiadau cwci

source: Email address
cy: Cyfeiriad ebost

source: We will resend the email with details of how to activate your account
cy: Byddwn yn ailanfon yr ebost gyda manylion am sut i actifadu’ch cyfrif

source: Enter an email address
cy: Nodwch gyfeiriad ebost

source: Email address must be 256 characters or fewer
cy: Rhaid i’r cyfeiriad ebost gynnwys 256 nod neu lai

source: Enter an email address in the correct format, like name@example.com
cy: Nodwch gyfeiriad ebost yn y fformat cywir, fel enw@enghraifft.com

source: Confirm email address
cy: Cadarnhau’r cyfeiriad ebost

source: Enter your first name
cy: Nodwch eich enw cyntaf

source: First name must be between 1 and 50 characters
cy: Rhaid i’r enw cyntaf fod rhwng 1 a 50 nod

source: First name must only include letters, and special characters such as hyphens, spaces and apostrophes
cy: Rhaid i’r enw cyntaf gynnwys llythrennau, a nodau arbennig fel cysylltnodau, bylchau a chollnodau yn unig

source: Enter your last name
cy: Nodwch eich cyfenw

source: Last name must be between 1 and 50 characters
cy: Rhaid i’r cyfenw fod rhwng 1 a 50 nod

source: Last name must only include letters, and special characters such as hyphens, spaces and apostrophes
cy: Rhaid i’r cyfenw gynnwys llythrennau, a nodau arbennig fel cysylltnodau, bylchau a chollnodau yn unig

source: Email addresses do not match, try again
cy: Nid yw’r cyfeiriadau ebost yn cyfateb. Rhowch gynnig arall arni

source: We will send you details on how to change your password
cy: Byddwn yn anfon manylion atoch ar sut i newid eich cyfrinair

source: Describe the area you have searched
cy: Disgrifiwch yr ardal rydych wedi ei chwilio

source: Find address
cy: Dod o hyd i gyfeiriad

source: Enter X coordinates (Eastings)
cy: Nodwch gyfesurynnau X (Dwyreiniad)

source: Coordinates must be of a numerical value
cy: Rhaid i gyfesurynnau fod mewn gwerth rhifiadol

source: Enter X coordinates
cy: Nodwch gyfesurynnau X

source: Enter Y coordinates (Northings)
cy: Nodwch gyfesurynnau Y (Gogleddiad)

source: Enter Y coordinates
cy: Nodwch gyfesurynnau Y

source: Search
cy: Chwilio

source: Enter coordinates in the correct format
cy: Nodwch y cyfesurynnau yn y fformat cywir

source: Enter a local land charge INSPIRE ID
cy: Nodwch ddynodydd INSPIRE pridiant tir lleol

source: Enter an INSPIRE ID
cy: Nodwch ddynodydd INSPIRE

source: You can find the title number on HM Land Registry documents, including copies of the register.
cy: Gallwch ddod o hyd i’r rhif teitl ar ddogfennau Cofrestrfa Tir EM, gan gynnwys copïau o’r gofrestr.

source: Enter a title number
cy: Nodwch rif teitl

source: Title number must be shorter than 20 characters
cy: Rhaid i’r rhif teitl fod yn fyrrach nag 20 nod

source: Find a result by Search ID
cy: Dod o hyd i ganlyniad trwy chwilio trwy ddynodydd

source: Search ID must be shorter than 80 characters
cy: Rhaid i’r dynodydd chwilio fod yn fyrrach nag 80 nod

source: For example, ‘SE5 9QY’ or ‘High Street’
cy: Er enghraifft, ‘SY5 9QY’ neu ‘High Street’

source: Search by reference or area
cy: Chwilio trwy gyfeirnod neu ardal

source: Enter a reference or area
cy: Nodwch gyfeirnod chwiliad neu ardal

source: Reference or area must be shorter than 80 characters
cy: Rhaid i’r cyfeirnod neu ardal fod yn fyrrach nag 80 nod
