Repository: LandRegistry/search-local-land-charges-ui
Catalog: server/translations/*/LC_MESSAGES/messages.po
Languages: cy

source: When you search, HM Land Registry enters into an agreement with you. HM Land Registry agrees to provide you with the facility to exercise your right to personally inspect the register or to apply for an official search certificate for the land or property selected by you at the time and date of your transaction. You can end this agreement at any time before you make payment (official search certificate). The agreement is between you and HM Land Registry and no-one else can enforce any of its terms
cy: Wrth chwilio, mae Cofrestrfa Tir EM yn ymrwymo i gytundeb â chi. Mae Cofrestrfa Tir EM yn cytuno i’ch darparu â’r cyfleuster i arfer eich hawl i archwilio’r gofrestr yn bersonol neu i wneud cais am dystysgrif chwiliad swyddogol ar gyfer y tir neu’r eiddo a ddewiswyd gennych ar adeg a dyddiad eich trafodiad. Gallwch ddod â’r cytundeb hyn i ben ar unrhyw adeg cyn ichi dalu (tystysgrif chwiliad swyddogol). Mae’r cytundeb rhyngoch chi a Chofrestrfa Tir EM ac ni all neb arall orfodi unrhyw un o’i thelerau

source: The online payment provider will confirm your purchase and provide a transaction reference
cy: Bydd y darparwr talu ar-lein yn cadarnhau eich pryniant ac yn darparu cyfeirnod trafodiad

source: Your agreement with HM Land Registry ends when you complete your personal inspection of the register or when your official search certificate is made available for you to view or download
cy: Daw eich cytundeb â Chofrestrfa Tir EM i ben pan fyddwch yn cwblhau eich archwiliad personol o’r gofrestr neu pan fydd eich tystysgrif chwiliad swyddogol ar gael ichi ei gweld neu ei lawrlwytho

source: Service delays and interruptions
cy: Oedi ac ymyrraeth gyda’r gwasanaeth

source: HM Land Registry is not liable to you or any other person for losses caused by
cy: Nid yw Cofrestrfa Tir EM yn atebol ichi nac unrhyw berson arall am golledion a achosir

source: delays to this service
cy: gan oedi i’r gwasanaeth hwn

source: getting your search result
cy: wrth gael canlyniad eich chwiliad

source: For example, from
cy: Er enghraifft, trwy

source: interruptions to the internet
cy: ymyrraeth ar y rhyngrwyd

source: services provided by third parties (anyone who is not HM Land Registry)
cy: wasanaethau a ddarperir gan drydydd partïon (unrhyw un nad yw’n Gofrestrfa Tir EM)

source: false information from linked websites
cy: wybodaeth ffug o wefannau cysylltiedig

source: Copyright and database rights
cy: Hawliau hawlfraint a chronfa ddata

source: The information in this service is subject to Crown copyright and database right. Also, use of address and mapping data (including the link between the address and its location) in this service is subject to
cy: Mae’r wybodaeth yn y gwasanaeth hwn yn ddarostyngedig i hawlfraint y Goron a hawl cronfa ddata. Yn ogystal, mae defnyddio data cyfeiriad a mapio (gan gynnwys y cysylltiad rhwng y cyfeiriad a’i leoliad) yn y gwasanaeth hwn yn ddarostyngedig i

source: Ordnance Survey licence terms and conditions
cy: delerau ac amodau trwydded yr Arolwg Ordnans

source: The information in the local land charges register may also include information in which other third parties (including the authority who registered the charge) claim copyright and/or database right. Therefore, reuse of this information for a purpose other than conducting a search of the local land charges register would require specific consent
cy: Gall y wybodaeth yn y gofrestr pridiannau tir lleol gynnwys gwybodaeth y gall trydydd partïon eraill (gan gynnwys yr awdurdod a gofrestrodd y pridiant) hawlio hawlfraint a/neu hawl cronfa ddata. Felly, byddai angen caniatâd penodol ar gyfer ailddefnyddio’r wybodaeth hon at ddiben heblaw cynnal chwiliad o’r gofrestr pridiannau tir lleol

source: Your information and how we use it
cy: Eich gwybodaeth a sut rydym yn ei defnyddio

source: We will hold your
cy: Byddwn yn cadw’ch

source: IP and email address
cy: Cyfeiriad Protocol Rhyngrwyd ac ebost

source: How we protect your information
cy: Sut y byddwn yn gwarchod eich gwybodaeth

source: HM Land Registry complies with the requirements set by the Data Protection Law
cy: Mae Cofrestrfa Tir EM yn cydymffurfio â’r gofynion a bennir gan y Gyfraith Diogelu Data

source: We use your personal information in accordance with the HM Land Registry’s Personal Information Charter to
cy: Rydym yn defnyddio’ch gwybodaeth bersonol yn unol â Siarter Gwybodaeth Bersonol Cofrestrfa Tir EM er mwyn

source: create and manage any account you open
cy: creu a rheoli unrhyw gyfrif a agorir gennych

source: meet our agreement obligations by supplying the personal and official search results to you, once the online payment provider confirms that your payment has been processed and is complete (official search)
cy: cwrdd â’n rhwymedigaethau cytundeb trwy ddarparu canlyniadau’r chwiliad personol a swyddogol ichi, unwaith y bydd y darparwr talu ar-lein yn cadarnhau bod eich taliad wedi ei brosesu a’i fod wedi ei gwblhau (chwiliad swyddogol)

source: record the search
cy: cofnodi’r chwiliad

source: contact you using the email address you provide
cy: cysylltu â chi gan ddefnyddio’r cyfeiriad ebost a ddarperir gennych

source: We may retain and share information with
cy: Efallai y byddwn yn cadw ac yn rhannu gwybodaeth gyda’r canlynol

source: other government departments
cy: adrannau eraill y llywodraeth

source: law enforcement and regulatory bodies, including specified anti-fraud organsiations under section 68 Serious Crime Act 2007
cy: cyrff gorfodaeth a rheoleiddio cyfraith, gan gynnwys sefydliadau gwrth-dwyll penodedig o dan adran 68 o Ddeddf Troseddau Difrifol 2007

source: This sharing of information helps to prevent and detect crime, for example, property fraud. It also helps with the investigation of land banking schemes
cy: Mae rhannu gwybodaeth yn helpu i atal a chanfod troseddau, er enghraifft, twyll eiddo. Mae hefyd yn helpu gyda’r ymchwilio i gynlluniau bancio tir

source: HM Land Registry will
cy: Bydd Cofrestrfa Tir EM

source: keep your personal information secure
cy: yn cadw’ch gwybodaeth bersonol yn ddiogel

source: not make it available for commercial use, such as marketing, without your permission
cy: yn sicrhau na fydd ar gael at ddefnydd masnachol, fel marchnata, heb eich caniatâd

source: share your information with other HM Land Registry teams to process your application
cy: yn rhannu eich gwybodaeth â thimau eraill Cofrestrfa Tir EM i brosesu’ch cais

source: Deleting or changing your account
cy: Dileu neu newid eich cyfrif

source: If you don’t use any account you have created for 12 months, we will delete it
cy: Os nad ydych yn defnyddio cyfrif a grëwyd gennych am 12 mis, byddwn yn ei ddileu

source: We don’t keep your personal information if you delete your account. It will be removed from our system when a Land Registry staff member closes the account
cy: Nid ydym yn cadw’ch gwybodaeth bersonol os ydych yn dileu’ch cyfrif. Caiff ei thynnu o’n system pan fydd aelod o staff Cofrestrfa Tir EM yn cau’r cyfrif

source: If you want to use a different email address, you’ll need to open a new account
cy: Os ydych am ddefnyddio cyfeiriad ebost gwahanol, bydd angen ichi agor cyfrif newydd

source: How to make a complaint
cy: Sut i wneud cwyn

source: If you’re unhappy with the service, contact HM Land Registry. You can
cy: Os ydych yn anhapus â’r gwasanaeth, cysylltwch â Chofrestrfa Tir EM. Gallwch

source: contact form
cy: ffurflen gysylltu

source: complete the online %(contact_form_link)s
cy: lenwi’r %(contact_form_link)s ar-lein

source: the HM Land Registry’s internal complaints procedure.
cy: drefn gwyno fewnol Cofrestrfa Tir EM.

source: If you’re unhappy with the answer you receive, follow %(complaints_link)s
cy: Os nad ydych yn hapus gyda’r ffordd rydym yn ymateb i’ch cwyn, dilynwch %(complaints_link)s

source: If you’re still unhappy with the answer contact the
cy: Os ydych yn parhau’n anhapus â’r ateb, cysylltwch

source: Independent Complaints Reviewer’s Office (ICR)
cy: â Swyddfa’r Adolygydd Cwynion Annibynnol (ACA)

source: The ICR can investigate your complaint independently from HM Land Registry
cy: Gall yr ACA ymchwilio i’ch cwyn yn annibynnol ar Gofrestrfa Tir EM

source: Active searches
cy: Chwiliadau gweithredol

source: Clear search
cy: Clirio’r chwiliad

source: Showing %(result_count_html)s search results for %(search_term_html)s
cy: Yn dangos %(result_count_html)s canlyniad chwilio ar gyfer %(search_term_html)s

source: Search reference
cy: Cyfeirnod chwilio

source: Search area
cy: Ardal chwilio

source: Expiry date
cy: Dyddiad dod i ben

source: Repeat search
cy: Ail chwilio

source: Search date
cy: Dyddiad chwilio

source: (Unavailable)
cy: (Ddim ar gael)

source: Active search information
cy: Gwybodaeth chwilio fyw

source: Hide searches
cy: Guddio chwiliadau

source: Show searches
cy: Dangos chwiliadau

source: No searches found
cy: Ni ddaethpwyd o hyd i unrhyw chwiliadau

source: Start a new search
cy: Dechrau chwiliad newydd

source: Change your details
cy: Newid eich manylion

source: Return to my account
cy: Dychwelyd i fy nghyfrif

source: Expired searches
cy: Chwiliadau sydd wedi dod i ben

source: Review and pay
cy: Adolygu a thalu

source: Expired search information
cy: Gwybodaeth chwiliadau sydd wedi dod i ben

source: Free searches we recommend you repeat
cy: Chwiliadau am ddim rydym yn argymell eich bod yn eu hailadrodd

source: You currently have no free searches we recommend you repeat
cy: Nid oes gennych unrhyw chwiliadau am ddim rydym yn argymell eich bod yn eu hailadrodd ar hyn o bryd

source: You have %(result_count)s search with updated local land charge information
cy: Mae gennych %(result_count)s chwiliad gyda gwybodaeth pridiant tir lleol wedi ei diweddaru

source: You have %(result_count)s searches with updated local land charge information
cy: Mae gennych %(result_count)s chwiliad gyda gwybodaeth pridiant tir lleol wedi ei diweddaru

source: Free searches with updated local land charge information
cy: Chwiliadau am ddim gyda gwybodaeth pridiant tir lleol wedi ei diweddaru

source: Date of search
cy: Dyddiad y chwiliad

source: Action
cy: Camau gweithredu

source: Free searches
cy: Chwiliadau am ddim

source: You have %(result_count)s search from the past 6 months
cy: Mae gennych %(result_count)s chwiliad o’r 6 mis diwethaf

source: You have %(result_count)s searches from the past 6 months
cy: Mae gennych %(result_count)s chwiliad o’r 6 mis diwethaf

source: Free search information
cy: Gwybodaeth chwilio am ddim

source: Change
cy: Newid

source: Account information
cy: Gwybodaeth am y cyfrif

source: Information
cy: Gwybodaeth

source: First name
cy: Enw cyntaf

source: Last name
cy: Cyfenw

source: Password
cy: Cyfrinair

source: Official searches we recommend you repeat
cy: Chwiliadau swyddogol rydym yn argymell eich bod yn eu hailadrodd

source: You currently have no official searches we recommend you repeat
cy: Nid oes gennych unrhyw chwiliadau swyddogol rydym yn argymell eich bod yn eu hailadrodd ar hyn o bryd

source: Official searches with updated local land charge information
cy: Chwiliadau swyddogol gyda gwybodaeth pridiant tir lleol wedi ei diweddaru

source: Searches we recommend you repeat
cy: Chwiliadau rydym yn argymell eich bod yn eu hailadrodd

source: You currently have no searches we recommend you repeat.
cy: Nid oes gennych unrhyw chwiliadau am ddim rydym yn argymell eich bod yn eu hailadrodd ar hyn o bryd

source: Some search results we have provided you with may not have contained all the relevant local land charge information.
cy: Mae’n bosibl na fydd canlyniadau rhai chwiliadau rydym wedi eu darparu ichi wedi cynnwys yr holl wybodaeth pridiant tir lleol perthnasol

source: We recommend you repeat these searches.
cy: Rydym yn argymell eich bod yn ailadrodd y chwiliadau hyn.

source: Manage account
cy: Rheoli cyfrif

source: My searches
cy: Fy chwiliadau

source: View Originating authority names
cy: Gweld enwau awdurdodau gwreiddiol

source: Use this list to check which originating authority names will be accepted onto the register when registering new charges. Previous names are recognised as valid, but cannot be used for new registrations.
cy: Defnyddiwch y rhestr hon i wirio pa enwau awdurdod gwreiddiol a dderbynnir ar y gofrestr wrth gofrestru arwystlon newydd. Cydnabyddir bod enwau blaenorol yn ddilys, ond ni ellir eu defnyddio ar gyfer cofrestriadau newydd.

source: Local Authority
cy: Awdurdod Lleol

source: Previous names
cy: Enwau blaenorol

source: Other originating authority
cy: Awdurdod gwreiddiol arall

source: Does ‘%(address)s’ match the exact search area?
cy: Ydy ‘%(address)s’ yn cyfateb â’r union ardal chwilio?

source: This description will be used on your official copy.
cy: Caiff y disgrifiad hwn ei ddefnyddio ar eich copi swyddogol.

source: Yes
cy: Ydy

source: No, I'd like to provide my own description
cy: Nac ydy, hoffwn ddarparu fy nisgrifiad fy hunan

source: You have 0 characters remaining
cy: Mae gennych 0 nod ar ôl

source: You have %(count)s character remaining
cy: Mae gennych %(count)s nod ar ôl

source: You have %(count)s characters remaining
cy: Mae gennych %(count)s nod ar ôl

source: You have %(count)s character too many
cy: Mae gennych %(count)s nod yn ormod

source: You have %(count)s characters too many
cy: Mae gennych %(count)s nod yn ormod

source: You can enter up to %(count)s characters
cy: Gallwch nodi hyd at %(count)s nod

source: You cannot change your search area after you have paid.
cy: Ni allwch newid eich ardal chwilio ar ôl ichi dalu.

source: Your payment will be processed by our payment service provider, WorldPay, through GOV.UK Pay. You should refer to the Privacy Notices of those organisations for details of how your personal data is used.
cy: Caiff eich taliad ei brosesu gan ein darparwr gwasanaeth talu, WorldPay, trwy GOV.UK Pay. Dylech gyfeirio at Rybuddion Preifatrwydd y sefydliadau hynny i gael manylion am sut y caiff eich data personol ei ddefnyddio.

source: Cancel and start a new search
cy: Canslo a dechrau chwiliad newydd

source: The shaded area shows your search.
cy: Mae’r ardal sydd wedi ei lliwio yn dangos eich chwiliad.

source: Loading official search result
cy: Wrthi’n llwytho canlyniad y chwiliad swyddogol

source: In progress
cy: Ar waith

source: When ready you can view this in active searches in your account.
cy: Pan fydd yn barod, gallwch ei weld yn chwiliadau byw yn eich cyfrif.

source: This may take a while to load. You do not need to refresh the page or contact us.
cy: Gall hyn gymryd amser i lwytho. Nid oes angen ichi adnewyddu’r dudalen na chysylltu â ni.

source: Download your official local land charges search result
cy: Lawrlwytho canlyniad eich chwiliad swyddogol pridiannau tir lleol

source: Official search result ready to download
cy: Canlyniad chwiliad swyddogol yn barod i’w lawrlwytho

source: What happens next
cy: Yr hyn sy’n digwydd nesaf

source: You can download your official search result. This will appear in your downloads folder.
cy: Gallwch lawrlwytho canlyniad eich chwiliad swyddogol. Bydd yn ymddangos yn eich ffolder lawrlwytho.

source: Download
cy: Lawrlwytho

source: Download light obstruction notice documents
cy: Lawrlwytho dogfennau rhybudd rhwystro goleuni

source: You can also view the official search result in your account in
cy: Gallwch weld canlyniad y chwiliad swyddogol yn eich cyfrif hefyd, yn

source: Your payment was successful
cy: Roedd eich taliad yn llwyddiannus

source: Your repeat search is in progress
cy: Mae eich ail chwiliad yn mynd yn ei flaen

source: Your payment reference number is
cy: Eich cyfeirnod talu yw

source: We are now creating your official search result. When ready, you can view this in active searches
cy: Rydym nawr yn creu canlyniad eich chwiliad swyddogol. Pan fydd yn barod, gallwch ei weld yn chwiliadau byw

source: Load your official search result
cy: Llwytho canlyniad eich chwiliad swyddogol

source: How would you like to provide your search area description?
cy: Sut hoffech chi ddarparu eich disgrifiad o’r ardal chwilio?

source: Choose an address from the list
cy: Dewis cyfeiriad o’r rhestr

source: Enter my own description
cy: Rhoi fy nisgrifiad fy hunan

source: Find an address
cy: Dod o hyd i gyfeiriad

source: Download documents relating to light obstruction notices in your official local land charges search. The documents for each light obstruction notice will be contained within a zip file.
cy: Lawrlwytho dogfennau’n ymwneud â rhybuddion rhwystro goleuni yn eich chwiliad pridiannau tir lleol swyddogol. Bydd y dogfennau ar gyfer pob rhybudd rhwystro goleuni wedi eu cynnwys mewn ffeil zip.

source: Light obstruction notices with related documents
cy: Rhybuddion rhwystro goleuni gyda dogfennau cysylltiedig

source: Return to official search result download
cy: Dychwelyd i lawrlwytho canlyniad chwiliad swyddogol

source: Search results for ‘%(search_term)s’
cy: Canlyniadau chwilio ar gyfer ‘%(search_term)s’

source: %(address_count)s addresses
cy: %(address_count)s cyfeiriad

source: Your search has found %(address_count_html)s. Select an address to continue.
cy: Mae eich chwiliad wedi dod o hyd i %(address_count_html)s. Dewiswch gyfeiriad i barhau.

source: Confirm search area
cy: Cadarnhau ardal chwilio

source: edit the search area
cy: olygu’r ardal chwilio

source: The shaded area shows your search. You can also %(edit_search_area_html)s.
cy: Mae’r ardal sydd wedi ei lliwio yn dangos eich chwiliad. Gallwch %(edit_search_area_html)s hefyd.

source: This search area is near a local authority area that is not yet available on this service. Your results will not include any local land charges for this local authority.
cy: Mae’r ardal chwilio hon ger ardal awdurdod lleol nad yw ar gael ar y gwasanaeth hwn eto. Ni fydd eich canlyniadau yn cynnwys unrhyw bridiannau tir lleol ar gyfer yr awdurdod lleol hwn.

source: Ordnance Survey Licence Terms and Conditions
cy: Telerau ac Amodau Trwydded yr Arolwg Ordnans

source: Use of address and mapping data is subject to %(os_link_html)s
cy: Mae defnyddio data cyfeiriad a mapio yn ddarostyngedig i %(os_link_html)s

source: This includes the link between the address and its location
cy: Mae hyn yn cynnwys y cyswllt rhwng y cyfeiriad a’i leoliad

source: Get help
cy: Cymorth

source: Get help with this service
cy: Cymorth gyda’r gwasanaeth hwn

source: opens in new tab
cy: mae’n agor mewn tab newydd

source: Find a search area by map
cy: Dod o hyd i ardal chwilio yn ôl map

source: Edit the search area
cy: Golygu’r ardal chwilio

source: Check the location and add a search area
cy: Gwirio’r lleoliad ac ychwanegu ardal chwilio

source: Add a search area
cy: Ychwanegu ardal chwilio

source: To view a local land charge, you will need to identify a property or area of land. This is known as a search area.
cy: I weld pridiant tir lleol, bydd angen ichi nodi eiddo neu ardal o dir. Gelwir hyn yn ardal chwilio.

source: Your search area has too many charges for a single search.
cy: Mae gormod o bridiannau am un chwiliad yn eich ardal chwilio.

source: You need to make your search area smaller to continue.
cy: Mae angen ichi wneud eich ardal chwilio yn llai i barhau.

source: The marker on the map shows the location of your search coordinates. You need to add a search area to continue.
cy: Mae’r marciwr ar y map yn dangos lleoliad eich cyfesurynnau chwilio. Mae angen ichi ychwanegu ardal chwilio i barhau.

source: You need to add a search area on the map to continue.
cy: Mae angen ichi ychwanegu ardal chwilio ar y map i barhau.

source: Map key
cy: Allwedd map

source: Location available key
cy: Allwedd mae’r lleoliad ar gael

source: Location available
cy: Mae’r lleoliad ar gael

source: Location not available key
cy: Allwedd nid yw’r lleoliad ar gael

source: Location not available
cy: Nid yw’r lleoliad ar gael

source: Location temporarily not available key
cy: Allwedd lleoliad ddim ar gael dros dro

source: Location temporarily not available
cy: Lleoliad ddim ar gael dros dro

source: Location of coordinates
cy: Lleoliad cyfesurynnau

source: Map options
cy: Dewisiadau ar gyfer y map

source: Select area from map
cy: Dewiswch yr ardal o’r map

source: Select one or more areas from the map
cy: Dewiswch un ardal neu ragor o’r map

source: Draw area
cy: Lluniwch ardal

source: Add points to draw your search area
cy: Ychwanegwch bwyntiau i luniadu’ch ardal chwilio

source: Edit area
cy: Golygu’r ardal

source: Move points to edit your search area
cy: Symudwch bwyntiau i olygu’ch ardal chwilio

source: Delete area
cy: Dileu’r ardal

source: Remove one or more areas from the map
cy: Tynnwch un ardal neu ragor o’r map

source: Snap to line on map
cy: Neidiwch i linell ar y map

source: Hover your cursor near a line on the map and it will jump to it automatically
cy: hofranwch eich cyrchwr yn agos at y llinell neu bwynt rydych am neidio iddo

source: Undo
cy: Dadwneud

source: Clear all
cy: Clirio popeth

source: Confirm area
cy: Cadarnhau ardal

source: Learn more about how to use this map
cy: Dysgu rhagor am sut i ddefnyddio’r map hwn

source: Your search area includes an area where information is temporarily not available
cy: Mae eich ardal chwilio yn cynnwys ardal lle nad oes gwybodaeth ar gael am y tro

source: Your search area may include information that is temporarily not available
cy: Mae eich chwiliad yn cynnwys meysydd nad ydym yn cadw gwybodaeth ar eu cyfer

source: Your search includes areas we do not hold information for
cy: Mae eich chwiliad yn cynnwys ardaloedd nad ydym yn cadw gwybodaeth ar eu cyfer

source: Your search includes an area where information is temporarily not available
cy: Mae eich chwiliad yn cynnwys ardal lle nad oes gwybodaeth ar gael am y tro

source: Your search includes areas where information is temporarily not available
cy: Mae eich chwiliad yn cynnwys ardaloedd lle nad oes gwybodaeth ar gael am y tro

source: Your search may include an area that is temporarily not available
cy: Efallai bydd eich chwiliad yn cynnwys ardal nad yw ar gael am y tro

source: Your search may include areas that are temporarily not available
cy: Efallai bydd eich chwiliad yn cynnwys ardaloedd nad ydynt ar gael am y tro

source: Your search includes an area we do not hold information for
cy: Mae eich chwiliad yn cynnwys ardaloedd nad ydym yn cadw gwybodaeth ar eu cyfer

source: This service only covers land in England and Wales.
cy: Mae’r gwasanaeth hwn yn cynnwys tir yng Nghymru a Lloegr yn unig.

source: This area is
cy: Yw’r ardal hon

source: These areas are
cy: yw’r ardaloedd hyn

source: We're currently working on making this information available again. You'll be able to search this area once we've done that.
cy: Rydym yn gweithio ar hyn o bryd ar sicrhau bod y wybodaeth hon ar gael eto. Byddwch yn gallu chwilio’r ardal hon ar ôl inni wneud hynny.

source: We're currently working on making this information available again. You'll be able to search these areas once we've done that.
cy: Rydym yn gweithio ar hyn o bryd ar sicrhau bod y wybodaeth hon ar gael eto. Byddwch yn gallu chwilio’r meysydd hyn ar ôl inni wneud hynny.

source: Contact us
cy: Cysylltwch â ni

source: if you need this search urgently. We may be able to complete this search for you.
cy: os oes angen y chwiliad hwn arnoch ar frys. Efallai y byddwn yn gallu cwblhau’r chwiliad hwn ar eich rhan.

source: You will need to contact them to search this area
cy: Bydd angen ichi gysylltu â nhw i chwilio’r ardal hon

source: You will need to contact these authorities and Registers of Scotland to search this area
cy: Bydd angen ichi gysylltu â’r awdurdodau hyn a Chofrestri’r Alban i chwilio’r ardal hon
