Repository: LandRegistry/search-local-land-charges-ui
Catalog: server/translations/*/LC_MESSAGES/messages.po
Languages: cy

source: The test was carried out by HM Land Registry. All the pages were tested using manual and automated testing tools by our website team. A further audit of some of the pages was carried out by the Digital Accessibility Centre (DAC) to the WCAG 2.1 AA standard
cy: Cynhaliwyd y prawf gan Gofrestrfa Tir EF.Profwyd yr holl dudalennau gan ddefnyddio offer profi â llaw ac offer profi awtomataidd gan dîm ein gwefan. Cynhaliwyd archwiliad pellach o rai o’r tudalennau gan y Ganolfan Hygyrchedd Digidol i safon 2.1 AA Canllawiau Hygyrchedd Cynnwys Gwe

source: Cookies are small files saved on your phone, tablet or computer when you visit a website
cy: Ffeiliau bach sy’n cael eu harbed ar eich ffôn, llechen neu gyfrifiadur pan fyddwch yn ymweld â gwefan yw cwcis

source: We use cookies to make
cy: Rydym yn defnyddio cwcis i wneud i

source: work and collect information about how you use our service
cy: weithio ac i gasglu gwybodaeth am sut rydych yn defnyddio'n gwasanaeth

source: Essential cookies
cy: Cwcis hanfodol

source: Essential cookies keep your information secure while you use
cy: Mae cwcis hanfodol yn cadw’ch gwybodaeth yn ddiogel wrth ichi ddefnyddio

source: We do not need to ask permission to use them
cy: Nid oes angen eich caniatâd arnom i’w defnyddio

source: Saves temporary information required to move through the service
cy: Yn arbed gwybodaeth dros dro sy'n ofynnol i symud trwy'r gwasanaeth

source: On browser close
cy: Ar ôl ichi gau eich porwr

source: Saves your cookie consent settings
cy: Yn arbed eich cydnabyddiaeth o'r faner cwci a pha gwcis sydd wedi eu derbyn gennych

source: 1 year
cy: 1 flwyddyn

source: Remembers the language you have selected as you move through the service and between your browser sessions. This is so that the service works in the same way for English and Welsh users.
cy: Yn cofio’ch dewis iaith wrth ichi symud trwy’r gwasanaeth a rhwng sesiynau pori. Mae hyn er mwyn i’r gwasanaeth weithio yn yr un modd i ddefnyddwyr Cymraeg a Saesneg eu hiaith.

source: Analytics cookies
cy: Cwcis dadansoddol

source: With your permission, we use Google Analytics to collect data about how you use
cy: Gyda’ch caniatâd, rydym yn defnyddio Google Analytics i gasglu data am sut rydych yn defnyddio

source: This information helps us to improve our service
cy: Mae’r wybodaeth hon yn ein helpu i wella’n gwasanaeth

source: Google is not allowed to use or share our analytics data with anyone
cy: Ni chaniateir i Google ddefnyddio neu rannu ein data dadansoddol gydag unrhyw un

source: Google Analytics stores anonymised information about
cy: Mae Google Analytics yn storio gwybodaeth ddienw am y canlynol

source: how you got to this service
cy: sut y cyrhaeddwyd y gwasanaeth

source: the pages you visit
cy: y tudalennau rydych yn ymweld â nhw

source: how long you spend on each page
cy: pa mor hir rydych yn ei dreulio ar bob tudalen

source: what you click on while you're using the service
cy: ar beth rydych yn clicio wrth ymweld â'r gwasanaeth

source: any errors you see while you're using the service
cy: unrhyw wallau a welwch wrth ichi ddefnyddio'r gwasanaeth

source: Google Analytics sets the following cookies:
cy: Mae Google Analytics yn gosod y cwcis canlynol:

source: Name
cy: Enw

source: Purpose
cy: Pwrpas

source: Expires
cy: Yn dod i ben

source: Checks if you've visited Search local land charges before. This helps us count how many people visit our site
cy: Gweld a ydych wedi ymweld â Chwilio am bridiannau tir lleol o’r blaen. Mae hyn yn ein helpu i gyfrif faint o bobl sy’n ymweld â’n safle

source: 2 years
cy: 2 flynedd

source: 24 hours
cy: 24 awr

source: Change your cookie settings
cy: Newid eich gosodiadau cwci

source: Get help with Search for local land charges
cy: Cymorth gyda Chwilio am bridiannau tir lleol

source: Questions about local land charge search results
cy: Cwestiynau am ganlyniadau chwiliadau pridiannau tir lleol

source: Contact the originating authority shown on your search result for all queries about local land charge search results. This includes missing local land charges and the separate CON29 service. The organisation is usually a local authority (local council).
cy: Cysylltwch â’r awdurdod gwreiddiol a ddangosir ar ganlyniad eich chwiliad ar gyfer pob ymholiad am ganlyniadau chwiliadau pridiannau tir lleol. Mae hyn yn cynnwys pridiannau tir lleol sydd ar goll, a’r gwasanaeth CON29 sydd ar wahân. Awdurdod lleol (cyngor lleol) yw’r sefydliad fel rheol.

source: Find your local council
cy: Dod o hyd i’ch cyngor lleol

source: View the local land charges search results guidance
cy: Darllenwch y canllawiau ar ganlyniadau chwiliadau pridiannau tir lleol

source: English
cy: Saesneg

source: Help using this service
cy: Cymorth gyda defnyddio’r gwasanaeth hwn

source: Contact HM Land Registry if you need help using this service or have technical queries.
cy: Cysylltwch â Chofrestrfa Tir EF os oes angen help arnoch i ddefnyddio’r gwasanaeth hwn neu os oes gennych ymholiadau technegol.

source: Telephone: 0300 006 0444
cy: Ffôn: 0300 006 0422 (gwasanaeth Cymraeg)

source: Welsh language: 0300 006 0422
cy: Ffôn: 0300 006 0444 (gwasanaeth Saesneg)

source: https://customerhelp.landregistry.gov.uk/llc_webform/
cy: https://customerhelp.landregistry.gov.uk/llc_webform_cy/

source: online contact form
cy: Ffurflen ar-lein

source: Request help through our %(contact_link_html)s.
cy: Gofyn am help trwy ein %(contact_link_html)s.

source: customers with particular needs, conditions or circumstances
cy: cwsmeriaid ag anghenion, cyflyrau neu amgylchiadau penodol

source: View more about how we can help %(customers_needs_html)s.
cy: Darllen rhagor am sut gallwn helpu %(customers_needs_html)s.

source: You can also contact us if you need support with:
cy: Gallwch gysylltu â ni hefyd os oes angen cymorth gyda’r canlynol arnoch chi:

source: local land charges search results guidance
cy: canllawiau ar ganlyniadau chwiliadau pridiannau tir lleol

source: how we can help customers with particular needs, conditions or circumstances
cy: sut gallwn helpu cwsmeriaid sydd ag anghenion, cyflyrau neu amgylchiadau penodol

source: HM Land Registry general enquiries
cy: Ymholiadau cyffredinol Cofrestrfa Tir EF

source: general enquiries
cy: ymholiadau cyffredinol

source: For other HM Land Registry queries, including land charges, use our %(general_enquiries_html)s contact us form.
cy: Ar gyfer ymholiadau eraill Cofrestrfa Tir EF, gan gynnwys Pridiannau Tir, defnyddiwch ein ffurflen gysylltu %(general_enquiries_html)s.

source: For other HM Land Registry queries, including land charges, use our %(online_contact_html)s
cy: Ar gyfer ymholiadau eraill Cofrestrfa Tir EF, gan gynnwys Pridiannau Tir, defnyddiwch ein %(online_contact_html)s

source: https://gov.uk/land-registry
cy: https://gov.uk/land-registry.cy

source: gov.uk/land-registry
cy: gov.uk/land-registry.cy

source: You can also visit %(gov_uk_lr_html)s.
cy: Gallwch edrych ar %(gov_uk_lr_html)s hefyd.

source: Give feedback on Search for local land charges
cy: Rhoi adborth am Chwilio am bridiannau tir lleol

source: This form is to give feedback only. We are unable to reply to comments individually, but we do use your feedback to help improve our service
cy: Mae’r ffurflen hon ar gyfer rhoi adborth yn unig. Nid ydym yn gallu ateb i sylwadau’n unigol ond rydym yn defnyddio’ch adborth i helpu i wella’n gwasanaeth

source: Do not include personal or financial information, like your National Insurance number or credit card details
cy: Peidiwch â chynnwys gwybodaeth bersonol neu ariannol, er enghraifft eich rhif Yswiriant Gwladol neu fanylion eich cerdyn credyd

source: This form should take around 5 minutes to complete
cy: Dylai gymryd tua 5 munud i lenwi’r ffurflen hon

source: If you need support using the service or have technical queries, visit %(get_help_html)s
cy: Os oes angen cymorth arnoch i ddefnyddio’r gwasanaeth neu os oes gennych ymholiadau technegol, ewch i %(get_help_html)s

source: Give feedback
cy: Rhoi adborth

source: How to use the map
cy: Sut i ddefnyddio’r map

source: How to select an area from the map
cy: Sut i ddewis ardal o’r map

source: You can only select an area from the map when you are zoomed in to a location (seeing a place close-up). Make sure you can see building outlines on the map
cy: Dim ond pan fyddwch wedi chwyddo mewn i leoliad gallwch ddewis ardal o’r map (gweld lle yn agos). Gwnewch yn siwr eich bod yn gallu gweld amlinelliadau adeiladu ar y map

source: Click the select area from map button
cy: Cliciwch y botwm Dewis ardal o’r map

source: Click on the part of the map you where you want to conduct a search. This will create a search area.
cy: Cliciwch ar y rhan o’r map lle rydych am gynnal chwiliad. Bydd hyn yn creu ardal chwilio.

source: You can click more than once to combine several features together. The video below shows how this works.
cy: Gallwch glicio mwy nag unwaith i gyfuno nifer o nodweddion gyda’i gilydd. Mae’r fideo isod yn dangos sut mae hyn yn gweithio.

source: Before confirming, ensure the search area captured includes all of the properties and land you want to search against, including (if necessary) driveways, alleys or gardens, etc.
cy: Cyn cadarnhau, gwnewch yn siwr bod yr ardal chwilio o dan sylw’n cynnwys yr holl eiddo a thir rydych am chwilio yn eu herbyn, gan gynnwys (os oes angen) dreifiau, lonydd cefn neu erddi, ac ati.

source: Using this feature once on a property may not always be enough to capture the whole affected area
cy: Efallai na fydd defnyddio’r nodwedd hon unwaith ar eiddo bob amser yn ddigon i ddal yr ardal gyfan yr effeithir arni

source: This video shows how to use the select area from map button.
cy: Mae’r fideo hwn yn dangos sut i ddefnyddio’r botwm Dewis ardal o’r map.

source: In the video, a user
cy: Yn y fideo, mae defnyddiwr

source: Clicks the select area from map button
cy: Yn clicio ar y botwm Dewis ardal o’r map

source: Clicks different map features one after the other to create a combined search area
cy: Yn clicio ar wahanol nodweddion map un ar ôl y llall i greu ardal chwilio gyfunol

source: Transcript for: how to use Select area from map
cy: Trawsgrifiad ar gyfer: Sut i ddefnyddio’r botwm Dewis ardal o’r map

source: How to select an area from the map (video)
cy: Sut i ddewis ardal o’r map (fideo)

source: How to draw your search area
cy: Sut i luniadu’ch ardal chwilio

source: Click the add area button
cy: Cliciwch y botwm ychwanegu ardal

source: choose a location on the map and click to start drawing
cy: dewiswch leoliad ar y map a chliciwch i ddechrau lluniadu

source: keep clicking around the edge of your search area to draw the extent
cy: parhewch i glicio o amgylch ymyl eich ardal chwilio i luniadu’r stent

source: to complete your shape, join the ends up or double click
cy: i gwblhau eich siâp, unwch y pennau neu cliciwch ddwywaith

source: To draw curves
cy: I luniadu cromliniau

source: hold down the SHIFT key and click
cy: daliwch yr allwedd SHIFT i lawr a chliciwch

source: release the SHIFT key and mouse button to stop drawing
cy: rhyddhewch yr allwedd SHIFT a botwm y llygoden i roi’r gorau i luniadu

source: or release only SHIFT to continue drawing a straight edge
cy: neu rhyddhewch yr allwedd SHIFT yn unig i barhau i luniadu ymyl syth

source: This video shows how to draw your search area using the add area button
cy: Mae’r fideo hon yn dangos sut i luniadu’ch ardal chwilio gan ddefnyddio’r botwm ychwanegu ardal

source: In the video, to draw an extent with straight edges, a user
cy: Yn y fideo, i luniadu maint ag ymylon syth, mae defnyddiwr:

source: clicks the add area button
cy: yn clicio’r botwm ychwanegu ardal

source: selects a place to start drawing
cy: yn dewis lle i ddechrau lluniadu

source: clicks the cursor on their start point
cy: yn clicio’r cyrchwr ar y man cychwyn

source: keeps clicking around the edges of the search area
cy: yn cadw clicio o amgylch ymylon yr ardal chwilio

source: double-clicks to finish drawing
cy: yn clicio ddwywaith i orffen lluniadu

source: In the video, to draw an extent with curved edges, a user
cy: Yn y fideo, i luniadu stent gydag ymylon crwm, mae defnyddiwr:

source: holds the SHIFT key to draw a curved extent edge
cy: yn dal yr allwedd SHIFT i luniadu stent gydag ymyl crwm

source: releases SHIFT and continues by drawing a straight edge
cy: yn rhyddhau SHIFT ac yn parhau trwy luniadu ymyl syth

source: Transcript for: How to draw your search area
cy: Trawsgrifiad ar gyfer: Sut i luniadu’ch ardal chwilio

source: How to draw your search area (video)
cy: Sut i luniadu’ch ardal chwilio (fideo)

source: How to edit your search area
cy: Sut i olygu’ch ardal chwilio

source: Click the edit area button
cy: Cliciwch y botwm golygu ardal

source: you will see your search area turn yellow
cy: byddwch yn gweld eich ardal chwilio yn troi’n felyn

source: click and drag the outline of your search area to edit it
cy: cliciwch a llusgwch amlinelliad eich ardal chwilio i’w golygu

source: click the edit area button again to finish editing
cy: cliciwch ar y botwm golygu ardal eto i orffen golygu

source: This video shows how to edit your search area using the edit area button
cy: Mae’r fideo hon yn dangos sut i olygu eich ardal chwilio gan ddefnyddio’r botwm ardal golygu

source: clicks the edit area button
cy: yn clicio’r botwm golygu ardal

source: sees the search area turn yellow
cy: yn gweld yr ardal chwilio yn troi’n felyn

source: clicks the cursor on one of the points
cy: yn clicio’r cyrchwr ar un o’r pwyntiau

source: drags the point to change the search area
cy: yn llusgo’r pwynt i newid yr ardal chwilio

source: holds ALT whilst clicking another point to delete it
cy: yn dal yr allwedd ALT wrth glicio ar bwynt arall i’w ddileu

source: clicks the edit area button again to finish editing
cy: yn clicio ar y botwm golygu ardal eto i orffen golygu

source: Transcript for: How to edit your search area
cy: Trawsgrifiad ar gyfer: Sut i olygu eich ardal chwilio

source: How to edit your search area (video)
cy: Sut i olygu’ch ardal chwilio (fideo)

source: How to draw a shape with snap to
cy: Sut i luniadu siâp gyda ‘snap to’

source: You can only use snap-to when you are zoomed into a location (seeing a place close-up)
cy: Dim ond pan fyddwch wedi chwyddo i leoliad (gweld lle yn agos) gallwch ddefnyddio ‘neidio i’r map’.

source: Click the snap to map box
cy: Cliciwch y blwch mapio ‘neidio i’r map’

source: hover your cursor near the line or point you want to snap to
cy: hofranwch eich cyrchwr yn agos at y llinell neu bwynt rydych am neidio iddo

source: the cursor will jump to that point automatically
cy: bydd y cyrchwr yn neidio i’r pwynt hwnnw yn awtomatig

source: This feature can also be used during other map interactions, like editing
cy: Gellir defnyddio’r nodwedd hon hefyd yn ystod rhyngweithiadau map eraill, fel golygu

source: This video shows how to draw a shape with snap to
cy: Mae’r fideo hon yn dangos sut i luniadu siâp gyda ‘neidio i’r map’

source: clicks the snap to check box
cy: yn clicio’r blwch gwirio ‘neidio i’r map’

source: places their cursor along the edge of their search area
cy: yn gosod y cyrchwr ar hyd ymyl yr ardal chwilio

source: sees the cursor snapping to the edges as they hover close to them
cy: yn gweld y cyrchwr yn neidio i’r ymylon wrth iddynt hofran yn agos atynt

source: closes the shape by joining up to their starting point
cy: yn cau’r siâp trwy ymuno â’r man cychwyn

source: clicks to finish drawing
cy: yn clicio i orffen lluniadu

source: Transcript for: How to draw a shape with snap to
cy: Trawsgrifiad ar gyfer: Sut i luniadu siâp gyda ‘neidio i’r map’

source: How to draw a shape with snap to (video)
cy: Sut i luniadu siâp gyda ‘neidio i’r map’ (fideo)

source: How to delete one search area
cy: Sut i ddileu un ardal chwilio

source: Click the delete area button
cy: Cliciwch y botwm dileu ardal

source: your search area will turn red
cy: bydd eich ardal chwilio yn troi’n goch

source: click the search area you want to delete
cy: cliciwch yr ardal chwilio rydych am ei dileu

source: This video shows how to delete one search area using the delete area button
cy: Mae’r fideo hon yn dangos sut i ddileu un ardal chwilio gan ddefnyddio’r botwm dileu ardal

source: clicks the delete area button
cy: yn clicio’r botwm dileu ardal

source: sees the search area go red
cy: yn gweld yr ardal chwilio yn mynd yn goch

source: clicks a search area to remove it
cy: yn clicio ardal chwilio i’w thynnu i ffwrdd

source: Transcript for: How to delete one search area
cy: Trawsgrifiad ar gyfer: Sut i ddileu un ardal chwilio

source: How to delete one search area (video)
cy: Sut i ddileu un ardal chwilio (fideo)

source: How to delete your search area
cy: Sut i ddileu eich ardal chwilio

source: Click the clear all button
cy: Cliciwch y botwm clirio popeth

source: By clicking the remove button it deletes everything you have drawn on the map
cy: Trwy glicio’r botwm tynnu i ffwrdd mae’n dileu popeth a luniadwyd ar y map

source: This video shows how to delete your search area using the clear all button
cy: Mae’r fideo hon yn dangos sut i ddileu eich ardal chwilio gan ddefnyddio’r botwm clirio popeth

source: clicks the clear all button
cy: yn clicio’r botwm clirio popeth

source: sees everything they have drawn on the map being deleted
cy: yn gweld popeth a luniadwyd ar y map yn cael ei ddileu

source: Transcript for: How to delete your search area
cy: Trawsgrifiad ar gyfer: Sut i ddileu eich ardal chwilio

source: How to delete your search area (video)
cy: Sut i ddileu eich ardal chwilio (fideo)

source: How to undo your last map interaction
cy: Sut i ddadwneud eich rhyngweithiad map diwethaf

source: Click the undo button
cy: Cliciwch y botwm dadwneud

source: Your last interaction(s) with the map will be reverted
cy: Caiff eich rhyngweithiad(au) diwethaf â’r map eu dychwelyd

source: You can click undo as many times as necessary to undo multiple actions in sequence
cy: Gallwch glicio dadwneud gymaint o weithiau ag sydd ei angen i ddadwneud sawl gweithred yn olynol

source: This video shows how to undo your last interactions with the map
cy: Mae’r fideo hon yn dangos sut i ddadwneud eich rhyngweithiadau diwethaf â’r map

source: In the video, a user:
cy: Yn y fideo, mae defnyddiwr:

source: makes two changes to the map
cy: yn gwneud dau newid i’r map

source: clicks the undo button twice
cy: yn clicio’r botwm dadwneud ddwywaith

source: sees those last changes being reverted
cy: yn gweld y newidiadau diwethaf hynny yn cael eu dychwelyd

source: Transcript for: How to undo your last map interaction
cy: Trawsgrifiad ar gyfer: Sut i ddadwneud eich rhyngweithiad map diwethaf

source: How to undo your last map interaction (video)
cy: Sut i ddadwneud eich rhyngweithiad map diwethaf (fideo)

source: How to use the map with a keyboard only
cy: Sut i ddefnyddio’r map gyda bysellfwrdd yn unig

source: Select an area from the map and delete areas using a keyboard only. The keyboard focus needs to be on the map to do this.
cy: Dewiswch ardal o’r map a dilëwch ardaloedd gan ddefnyddio bysellfwrdd yn unig. Rhaid i ffocws y bysellfwrdd fod ar y map i wneud hyn.

source: You cannot draw or edit an area using a keyboard.
cy: Ni allwch lunio na golygu ardal gan ddefnyddio bysellfwrdd.

source: Keyboard controls
cy: Rheoli’r bysellfwrdd

source: Arrow keys to move the map.
cy: Bysellau saeth i symud y map.

source: Shift key with arrows to fine-tune the position.
cy: Bysell Shifft gyda’r saethau i fireinio’r lleoliad.

source: + and - keys to zoom.
cy: Bysellau + a - i chwyddo.

source: Space bar or enter key to select the area at the centre of the map.
cy: Bar gofod neu fysell Enter i ddewis yr ardal ar ganol y map.

source: You can only select an area from the map when you are zoomed in to a location (seeing a place close-up). This option will be inactive until you are zoomed in enough. Make sure you can see building outlines on the map.
cy: Dim ond pan fyddwch wedi chwyddo i mewn i leoliad y gallwch ddewis ardal o'r map (gweld lle yn agos). Bydd yr opsiwn hwn yn anactif nes eich bod wedi chwyddo digon. Gwnewch yn siŵr eich bod yn gallu gweld amlinelliadau adeiladau ar y map.

source: Select the select area from map radio button.
cy: Dewiswch yr ardal ddewis o'r botwm radio map.

source: Select the part of the map where you want to conduct a search. This will create a search area. You can select more than once to combine several features together.
cy: Dewiswch y rhan o'r map lle rydych chi am gynnal chwiliad. Bydd hyn yn creu ardal chwilio. Gallwch ddewis mwy nag unwaith i gyfuno sawl nodwedd gyda'i gilydd.

source: Before confirming, ensure your search area includes all of the properties and land you want to search against, including any driveways, alleys or gardens, etc. Using the select area from map feature once may not capture all of your search area.
cy: Cyn cadarnhau, sicrhewch fod eich ardal chwilio yn cynnwys yr holl eiddo a thir rydych am chwilio yn eu herbyn, gan gynnwys unrhyw dramwyfeydd, lonydd cefn neu erddi, ac ati. Mae'n bosibl na fydd defnyddio'r nodwedd ardal ddethol o'r map unwaith yn dal eich holl ardal chwilio.

source: This video shows how to select an area from the map.
cy: Mae'r fideo hwn yn dangos sut i ddewis ardal o'r map.

source: Selects the select area from map radio button.
cy: Yn dewis yr ardal ddethol o'r botwm radio map.

source: Selects different map areas one after the other to create a combined search area.
cy: Yn dewis gwahanol ardaloedd map un ar ôl y llall i greu ardal chwilio gyfunol.

source: Transcript for: How to select an area from the map
cy: Trawsgrifiad ar gyfer: Sut i ddewis ardal o'r map

source: Select the draw area radio button.
cy: Dewiswch y botwm radio ardal dynnu.

source: Select a point on the map to start drawing.
cy: Dewiswch bwynt ar y map i ddechrau tynnu llun.

source: Keep selecting points to draw your search area.
cy: Parhewch i ddewis pwyntiau i dynnu llun eich ardal chwilio.

source: Select the first point again, or double click anywhere, to complete your search area.
cy: Dewiswch y pwynt cyntaf eto, neu cliciwch ddwywaith yn unrhyw le, i gwblhau eich ardal chwilio.

source: Hold down the SHIFT key and select.
cy: Daliwch yr allwedd SHIFT i lawr a dewiswch.

source: Release the SHIFT key and mouse button to stop drawing, or release only SHIFT to continue drawing a straight edge.
cy: Rhyddhewch allwedd SHIFT a botwm y llygoden i roi'r gorau i dynnu llun, neu rhyddhewch SHIFT yn unig i barhau i dynnu ymyl syth.

source: Before confirming, ensure your search area includes all of the properties and land you want to search against, including any driveways, alleys or gardens, etc.
cy: Cyn cadarnhau, sicrhewch fod eich ardal chwilio yn cynnwys yr holl eiddo a thir yr hoffech chwilio yn eu herbyn, gan gynnwys unrhyw dramwyfeydd, lonydd cefn neu erddi, ac ati.

source: This video shows how to draw your search area using the draw area radio button.
cy: Mae'r fideo hwn yn dangos sut i dynnu llun eich ardal chwilio gan ddefnyddio'r botwm radio ardal dynnu.

source: In the video, to draw a search area with straight edges, a user:
cy: Yn y fideo, i dynnu ardal chwilio gydag ymylon syth, defnyddiwr:

source: Selects the draw area radio button.
cy: Yn dewis y botwm radio ardal dynnu.

source: Selects a place on the map to start drawing.
cy: Yn dewis lle ar y map i ddechrau tynnu llun.

source: Keeps selecting around the edges of the search area.
cy: Yn dal i ddewis o amgylch ymylon yr ardal chwilio.

source: Joins the points to stop drawing.
cy: Yn ymuno â'r pwyntiau i roi'r gorau i dynnu llun.

source: In the video, to draw an extent with curved edges, a user:
cy: Yn y fideo, i dynnu maint ag ymylon crwm, mae defnyddiwr:
